Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x2299 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x23b53): GNU C11 9.3.1 20200408 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0xb500c): ../Core/Src/main.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x6b8b6): C:/Users/Desenvolvimento/STM32CubeIDE/workspace_1.7.0/ButtonsWithFreeRTOS/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <2a>   DW_AT_encoding    : 5	(signed)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_type        : <0x22a>
    <30>   DW_AT_decl_file   : 7
    <31>   DW_AT_decl_line   : 66
    <32>   DW_AT_decl_column : 1
    <33>   DW_AT_sibling     : <0x22a>
 <2><37>: Abbrev Number: 3 (DW_TAG_enumerator)
    <38>   DW_AT_name        : (indirect string, offset: 0x1dc54): NonMaskableInt_IRQn
    <3c>   DW_AT_const_value : -14
 <2><3d>: Abbrev Number: 3 (DW_TAG_enumerator)

    <259>   DW_AT_encoding    : 7	(unsigned)
    <25a>   DW_AT_name        : (indirect string, offset: 0xc2464): short unsigned int
 <1><25e>: Abbrev Number: 6 (DW_TAG_typedef)
    <25f>   DW_AT_name        : (indirect string, offset: 0x7cde6): __int32_t
    <263>   DW_AT_decl_file   : 3
    <264>   DW_AT_decl_line   : 77
    <265>   DW_AT_decl_column : 24
    <266>   DW_AT_type        : <0x26a>
 <1><26a>: Abbrev Number: 5 (DW_TAG_base_type)
    <26b>   DW_AT_byte_size   : 4
    <26c>   DW_AT_encoding    : 5	(signed)
    <26d>   DW_AT_name        : (indirect string, offset: 0x106a3): long int
 <1><271>: Abbrev Number: 6 (DW_TAG_typedef)
    <272>   DW_AT_name        : (indirect string, offset: 0x81352): __uint32_t
    <276>   DW_AT_decl_file   : 3
    <277>   DW_AT_decl_line   : 79
    <278>   DW_AT_decl_column : 25
    <279>   DW_AT_type        : <0x27d>
 <1><27d>: Abbrev Number: 5 (DW_TAG_base_type)
    <27e>   DW_AT_byte_size   : 4
    <27f>   DW_AT_encoding    : 7	(unsigned)
    <280>   DW_AT_name        : (indirect string, offset: 0x4e195): long unsigned int
 <1><284>: Abbrev Number: 5 (DW_TAG_base_type)
    <285>   DW_AT_byte_size   : 8
    <286>   DW_AT_encoding    : 5	(signed)
    <287>   DW_AT_name        : (indirect string, offset: 0x5c6a5): long long int
 <1><28b>: Abbrev Number: 5 (DW_TAG_base_type)
    <28c>   DW_AT_byte_size   : 8
    <28d>   DW_AT_encoding    : 7	(unsigned)
    <28e>   DW_AT_name        : (indirect string, offset: 0x29df3): long long unsigned int
 <1><292>: Abbrev Number: 7 (DW_TAG_base_type)
    <293>   DW_AT_byte_size   : 4
    <294>   DW_AT_encoding    : 5	(signed)
    <295>   DW_AT_name        : int
 <1><299>: Abbrev Number: 5 (DW_TAG_base_type)
    <29a>   DW_AT_byte_size   : 4
    <29b>   DW_AT_encoding    : 7	(unsigned)
    <29c>   DW_AT_name        : (indirect string, offset: 0xfc5b): unsigned int
 <1><2a0>: Abbrev Number: 6 (DW_TAG_typedef)
    <2a1>   DW_AT_name        : (indirect string, offset: 0x3ba54): uint8_t
    <2a5>   DW_AT_decl_file   : 4
    <2a6>   DW_AT_decl_line   : 24
    <2a7>   DW_AT_decl_column : 19
    <2a8>   DW_AT_type        : <0x231>
 <1><2ac>: Abbrev Number: 8 (DW_TAG_const_type)
    <2ad>   DW_AT_type        : <0x2a0>
 <1><2b1>: Abbrev Number: 6 (DW_TAG_typedef)
    <2b2>   DW_AT_name        : (indirect string, offset: 0xda8c): uint16_t
    <2b6>   DW_AT_decl_file   : 4
    <2b7>   DW_AT_decl_line   : 36
    <2b8>   DW_AT_decl_column : 20
    <2b9>   DW_AT_type        : <0x24b>
 <1><2bd>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <2be>   DW_AT_type        : <0x2b1>
 <1><2c2>: Abbrev Number: 6 (DW_TAG_typedef)
    <2c3>   DW_AT_name        : (indirect string, offset: 0x7cde8): int32_t
    <2c7>   DW_AT_decl_file   : 4
    <2c8>   DW_AT_decl_line   : 44
    <2c9>   DW_AT_decl_column : 19
    <2ca>   DW_AT_type        : <0x25e>
 <1><2ce>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <2cf>   DW_AT_type        : <0x2c2>
 <1><2d3>: Abbrev Number: 6 (DW_TAG_typedef)
    <2d4>   DW_AT_name        : (indirect string, offset: 0x93fe8): uint32_t
    <2d8>   DW_AT_decl_file   : 4
    <2d9>   DW_AT_decl_line   : 48
    <2da>   DW_AT_decl_column : 20
    <2db>   DW_AT_type        : <0x271>
 <1><2df>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <2e0>   DW_AT_type        : <0x2d3>
 <1><2e4>: Abbrev Number: 10 (DW_TAG_variable)
    <2e5>   DW_AT_name        : (indirect string, offset: 0x41d0): ITM_RxBuffer
    <2e9>   DW_AT_decl_file   : 5
    <2ea>   DW_AT_decl_line   : 2052
    <2ec>   DW_AT_decl_column : 25
    <2ed>   DW_AT_type        : <0x2ce>
    <2f1>   DW_AT_external    : 1
    <2f1>   DW_AT_declaration : 1
 <1><2f1>: Abbrev Number: 11 (DW_TAG_variable)
    <2f2>   DW_AT_name        : (indirect string, offset: 0x99185): SystemCoreClock
    <2f6>   DW_AT_decl_file   : 6
    <2f7>   DW_AT_decl_line   : 57
    <2f8>   DW_AT_decl_column : 17
    <2f9>   DW_AT_type        : <0x2d3>
    <2fd>   DW_AT_external    : 1
    <2fd>   DW_AT_declaration : 1
 <1><2fd>: Abbrev Number: 12 (DW_TAG_array_type)
    <2fe>   DW_AT_type        : <0x2ac>
    <302>   DW_AT_sibling     : <0x30d>
 <2><306>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <307>   DW_AT_type        : <0x299>
    <30b>   DW_AT_upper_bound : 15
 <2><30c>: Abbrev Number: 0
 <1><30d>: Abbrev Number: 8 (DW_TAG_const_type)
    <30e>   DW_AT_type        : <0x2fd>
 <1><312>: Abbrev Number: 11 (DW_TAG_variable)
    <313>   DW_AT_name        : (indirect string, offset: 0xb831e): AHBPrescTable
    <317>   DW_AT_decl_file   : 6
    <318>   DW_AT_decl_line   : 58
    <319>   DW_AT_decl_column : 22
    <31a>   DW_AT_type        : <0x30d>
    <31e>   DW_AT_external    : 1
    <31e>   DW_AT_declaration : 1
 <1><31e>: Abbrev Number: 12 (DW_TAG_array_type)
    <31f>   DW_AT_type        : <0x2ac>
    <323>   DW_AT_sibling     : <0x32e>
 <2><327>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <328>   DW_AT_type        : <0x299>
    <32c>   DW_AT_upper_bound : 7
 <2><32d>: Abbrev Number: 0
 <1><32e>: Abbrev Number: 8 (DW_TAG_const_type)
    <32f>   DW_AT_type        : <0x31e>
 <1><333>: Abbrev Number: 11 (DW_TAG_variable)
    <334>   DW_AT_name        : (indirect string, offset: 0x82214): APBPrescTable
    <338>   DW_AT_decl_file   : 6
    <339>   DW_AT_decl_line   : 59
    <33a>   DW_AT_decl_column : 22
    <33b>   DW_AT_type        : <0x32e>
    <33f>   DW_AT_external    : 1
    <33f>   DW_AT_declaration : 1
 <1><33f>: Abbrev Number: 14 (DW_TAG_structure_type)
    <340>   DW_AT_byte_size   : 184
    <341>   DW_AT_decl_file   : 7
    <342>   DW_AT_decl_line   : 170
    <343>   DW_AT_decl_column : 9
    <344>   DW_AT_sibling     : <0x528>
 <2><348>: Abbrev Number: 15 (DW_TAG_member)
    <349>   DW_AT_name        : ISR
    <34d>   DW_AT_decl_file   : 7
    <34e>   DW_AT_decl_line   : 172
    <34f>   DW_AT_decl_column : 17
    <350>   DW_AT_type        : <0x2df>
    <354>   DW_AT_data_member_location: 0
 <2><355>: Abbrev Number: 15 (DW_TAG_member)
    <356>   DW_AT_name        : IER
    <35a>   DW_AT_decl_file   : 7
    <35b>   DW_AT_decl_line   : 173
    <35c>   DW_AT_decl_column : 17
    <35d>   DW_AT_type        : <0x2df>
    <361>   DW_AT_data_member_location: 4
 <2><362>: Abbrev Number: 15 (DW_TAG_member)
    <363>   DW_AT_name        : CR
    <366>   DW_AT_decl_file   : 7
    <367>   DW_AT_decl_line   : 174
    <368>   DW_AT_decl_column : 17
    <369>   DW_AT_type        : <0x2df>
    <36d>   DW_AT_data_member_location: 8
 <2><36e>: Abbrev Number: 16 (DW_TAG_member)
    <36f>   DW_AT_name        : (indirect string, offset: 0xce43b): CFGR
    <373>   DW_AT_decl_file   : 7
    <374>   DW_AT_decl_line   : 175
    <375>   DW_AT_decl_column : 17
    <376>   DW_AT_type        : <0x2df>
    <37a>   DW_AT_data_member_location: 12
 <2><37b>: Abbrev Number: 16 (DW_TAG_member)
    <37c>   DW_AT_name        : (indirect string, offset: 0xbf35e): RESERVED0
    <380>   DW_AT_decl_file   : 7
    <381>   DW_AT_decl_line   : 176
    <382>   DW_AT_decl_column : 17
    <383>   DW_AT_type        : <0x2d3>
    <387>   DW_AT_data_member_location: 16
 <2><388>: Abbrev Number: 16 (DW_TAG_member)
    <389>   DW_AT_name        : (indirect string, offset: 0xb635d): SMPR1
    <38d>   DW_AT_decl_file   : 7
    <38e>   DW_AT_decl_line   : 177
    <38f>   DW_AT_decl_column : 17
    <390>   DW_AT_type        : <0x2df>
    <394>   DW_AT_data_member_location: 20
 <2><395>: Abbrev Number: 16 (DW_TAG_member)
    <396>   DW_AT_name        : (indirect string, offset: 0x49707): SMPR2
    <39a>   DW_AT_decl_file   : 7
    <39b>   DW_AT_decl_line   : 178
    <39c>   DW_AT_decl_column : 17
    <39d>   DW_AT_type        : <0x2df>
    <3a1>   DW_AT_data_member_location: 24
 <2><3a2>: Abbrev Number: 16 (DW_TAG_member)
    <3a3>   DW_AT_name        : (indirect string, offset: 0xbf368): RESERVED1
    <3a7>   DW_AT_decl_file   : 7
    <3a8>   DW_AT_decl_line   : 179
    <3a9>   DW_AT_decl_column : 17
    <3aa>   DW_AT_type        : <0x2d3>
    <3ae>   DW_AT_data_member_location: 28
 <2><3af>: Abbrev Number: 15 (DW_TAG_member)
    <3b0>   DW_AT_name        : TR1
    <3b4>   DW_AT_decl_file   : 7
    <3b5>   DW_AT_decl_line   : 180
    <3b6>   DW_AT_decl_column : 17
    <3b7>   DW_AT_type        : <0x2df>
    <3bb>   DW_AT_data_member_location: 32
 <2><3bc>: Abbrev Number: 15 (DW_TAG_member)
    <3bd>   DW_AT_name        : TR2
    <3c1>   DW_AT_decl_file   : 7
    <3c2>   DW_AT_decl_line   : 181
    <3c3>   DW_AT_decl_column : 17
    <3c4>   DW_AT_type        : <0x2df>
    <3c8>   DW_AT_data_member_location: 36
 <2><3c9>: Abbrev Number: 15 (DW_TAG_member)
    <3ca>   DW_AT_name        : TR3
    <3ce>   DW_AT_decl_file   : 7
    <3cf>   DW_AT_decl_line   : 182
    <3d0>   DW_AT_decl_column : 17
    <3d1>   DW_AT_type        : <0x2df>
    <3d5>   DW_AT_data_member_location: 40
 <2><3d6>: Abbrev Number: 16 (DW_TAG_member)
    <3d7>   DW_AT_name        : (indirect string, offset: 0xbf372): RESERVED2
    <3db>   DW_AT_decl_file   : 7
    <3dc>   DW_AT_decl_line   : 183
    <3dd>   DW_AT_decl_column : 17
    <3de>   DW_AT_type        : <0x2d3>
    <3e2>   DW_AT_data_member_location: 44
 <2><3e3>: Abbrev Number: 16 (DW_TAG_member)
    <3e4>   DW_AT_name        : (indirect string, offset: 0x6bc1d): SQR1
    <3e8>   DW_AT_decl_file   : 7
    <3e9>   DW_AT_decl_line   : 184
    <3ea>   DW_AT_decl_column : 17
    <3eb>   DW_AT_type        : <0x2df>
    <3ef>   DW_AT_data_member_location: 48
 <2><3f0>: Abbrev Number: 16 (DW_TAG_member)
    <3f1>   DW_AT_name        : (indirect string, offset: 0xeaf7): SQR2
    <3f5>   DW_AT_decl_file   : 7
    <3f6>   DW_AT_decl_line   : 185
    <3f7>   DW_AT_decl_column : 17
    <3f8>   DW_AT_type        : <0x2df>
    <3fc>   DW_AT_data_member_location: 52
 <2><3fd>: Abbrev Number: 16 (DW_TAG_member)
    <3fe>   DW_AT_name        : (indirect string, offset: 0xeafc): SQR3
    <402>   DW_AT_decl_file   : 7
    <403>   DW_AT_decl_line   : 186
    <404>   DW_AT_decl_column : 17
    <405>   DW_AT_type        : <0x2df>
    <409>   DW_AT_data_member_location: 56
 <2><40a>: Abbrev Number: 16 (DW_TAG_member)
    <40b>   DW_AT_name        : (indirect string, offset: 0xeb01): SQR4
    <40f>   DW_AT_decl_file   : 7
    <410>   DW_AT_decl_line   : 187
    <411>   DW_AT_decl_column : 17
    <412>   DW_AT_type        : <0x2df>
    <416>   DW_AT_data_member_location: 60
 <2><417>: Abbrev Number: 15 (DW_TAG_member)
    <418>   DW_AT_name        : DR
    <41b>   DW_AT_decl_file   : 7
    <41c>   DW_AT_decl_line   : 188
    <41d>   DW_AT_decl_column : 17
    <41e>   DW_AT_type        : <0x2df>
    <422>   DW_AT_data_member_location: 64
 <2><423>: Abbrev Number: 16 (DW_TAG_member)
    <424>   DW_AT_name        : (indirect string, offset: 0xbf37c): RESERVED3
    <428>   DW_AT_decl_file   : 7
    <429>   DW_AT_decl_line   : 189
    <42a>   DW_AT_decl_column : 17
    <42b>   DW_AT_type        : <0x2d3>
    <42f>   DW_AT_data_member_location: 68
 <2><430>: Abbrev Number: 16 (DW_TAG_member)
    <431>   DW_AT_name        : (indirect string, offset: 0xb79f4): RESERVED4
    <435>   DW_AT_decl_file   : 7
    <436>   DW_AT_decl_line   : 190
    <437>   DW_AT_decl_column : 17
    <438>   DW_AT_type        : <0x2d3>
    <43c>   DW_AT_data_member_location: 72
 <2><43d>: Abbrev Number: 16 (DW_TAG_member)
    <43e>   DW_AT_name        : (indirect string, offset: 0x42204): JSQR
    <442>   DW_AT_decl_file   : 7
    <443>   DW_AT_decl_line   : 191
    <444>   DW_AT_decl_column : 17
    <445>   DW_AT_type        : <0x2df>
    <449>   DW_AT_data_member_location: 76
 <2><44a>: Abbrev Number: 16 (DW_TAG_member)
    <44b>   DW_AT_name        : (indirect string, offset: 0xbf3aa): RESERVED5
    <44f>   DW_AT_decl_file   : 7
    <450>   DW_AT_decl_line   : 192
    <451>   DW_AT_decl_column : 17
    <452>   DW_AT_type        : <0x528>
    <456>   DW_AT_data_member_location: 80
 <2><457>: Abbrev Number: 16 (DW_TAG_member)
    <458>   DW_AT_name        : (indirect string, offset: 0x859a3): OFR1
    <45c>   DW_AT_decl_file   : 7
    <45d>   DW_AT_decl_line   : 193
    <45e>   DW_AT_decl_column : 17
    <45f>   DW_AT_type        : <0x2df>
    <463>   DW_AT_data_member_location: 96
 <2><464>: Abbrev Number: 16 (DW_TAG_member)
    <465>   DW_AT_name        : (indirect string, offset: 0xa9a1c): OFR2
    <469>   DW_AT_decl_file   : 7
    <46a>   DW_AT_decl_line   : 194
    <46b>   DW_AT_decl_column : 17
    <46c>   DW_AT_type        : <0x2df>
    <470>   DW_AT_data_member_location: 100
 <2><471>: Abbrev Number: 16 (DW_TAG_member)
    <472>   DW_AT_name        : (indirect string, offset: 0x859d8): OFR3
    <476>   DW_AT_decl_file   : 7
    <477>   DW_AT_decl_line   : 195
    <478>   DW_AT_decl_column : 17
    <479>   DW_AT_type        : <0x2df>
    <47d>   DW_AT_data_member_location: 104
 <2><47e>: Abbrev Number: 16 (DW_TAG_member)
    <47f>   DW_AT_name        : (indirect string, offset: 0xa9a3b): OFR4
    <483>   DW_AT_decl_file   : 7
    <484>   DW_AT_decl_line   : 196
    <485>   DW_AT_decl_column : 17
    <486>   DW_AT_type        : <0x2df>
    <48a>   DW_AT_data_member_location: 108
 <2><48b>: Abbrev Number: 16 (DW_TAG_member)
    <48c>   DW_AT_name        : (indirect string, offset: 0xbf3b4): RESERVED6
    <490>   DW_AT_decl_file   : 7
    <491>   DW_AT_decl_line   : 197
    <492>   DW_AT_decl_column : 17
    <493>   DW_AT_type        : <0x528>
    <497>   DW_AT_data_member_location: 112
 <2><498>: Abbrev Number: 16 (DW_TAG_member)
    <499>   DW_AT_name        : (indirect string, offset: 0x82267): JDR1
    <49d>   DW_AT_decl_file   : 7
    <49e>   DW_AT_decl_line   : 198
    <49f>   DW_AT_decl_column : 17
    <4a0>   DW_AT_type        : <0x2df>
    <4a4>   DW_AT_data_member_location: 128
 <2><4a5>: Abbrev Number: 16 (DW_TAG_member)
    <4a6>   DW_AT_name        : (indirect string, offset: 0x8226c): JDR2
    <4aa>   DW_AT_decl_file   : 7
    <4ab>   DW_AT_decl_line   : 199
    <4ac>   DW_AT_decl_column : 17
    <4ad>   DW_AT_type        : <0x2df>
    <4b1>   DW_AT_data_member_location: 132
 <2><4b2>: Abbrev Number: 16 (DW_TAG_member)
    <4b3>   DW_AT_name        : (indirect string, offset: 0x82271): JDR3
    <4b7>   DW_AT_decl_file   : 7
    <4b8>   DW_AT_decl_line   : 200
    <4b9>   DW_AT_decl_column : 17
    <4ba>   DW_AT_type        : <0x2df>
    <4be>   DW_AT_data_member_location: 136
 <2><4bf>: Abbrev Number: 16 (DW_TAG_member)
    <4c0>   DW_AT_name        : (indirect string, offset: 0x36a86): JDR4
    <4c4>   DW_AT_decl_file   : 7
    <4c5>   DW_AT_decl_line   : 201
    <4c6>   DW_AT_decl_column : 17
    <4c7>   DW_AT_type        : <0x2df>
    <4cb>   DW_AT_data_member_location: 140
 <2><4cc>: Abbrev Number: 16 (DW_TAG_member)
    <4cd>   DW_AT_name        : (indirect string, offset: 0xbf3be): RESERVED7
    <4d1>   DW_AT_decl_file   : 7
    <4d2>   DW_AT_decl_line   : 202
    <4d3>   DW_AT_decl_column : 17
    <4d4>   DW_AT_type        : <0x528>
    <4d8>   DW_AT_data_member_location: 144
 <2><4d9>: Abbrev Number: 16 (DW_TAG_member)
    <4da>   DW_AT_name        : (indirect string, offset: 0x8130b): AWD2CR
    <4de>   DW_AT_decl_file   : 7
    <4df>   DW_AT_decl_line   : 203
    <4e0>   DW_AT_decl_column : 17
    <4e1>   DW_AT_type        : <0x2df>
    <4e5>   DW_AT_data_member_location: 160
 <2><4e6>: Abbrev Number: 16 (DW_TAG_member)
    <4e7>   DW_AT_name        : (indirect string, offset: 0x9d106): AWD3CR
    <4eb>   DW_AT_decl_file   : 7
    <4ec>   DW_AT_decl_line   : 204
    <4ed>   DW_AT_decl_column : 17
    <4ee>   DW_AT_type        : <0x2df>
    <4f2>   DW_AT_data_member_location: 164
 <2><4f3>: Abbrev Number: 16 (DW_TAG_member)
    <4f4>   DW_AT_name        : (indirect string, offset: 0x7908e): RESERVED8
    <4f8>   DW_AT_decl_file   : 7
    <4f9>   DW_AT_decl_line   : 205
    <4fa>   DW_AT_decl_column : 17
    <4fb>   DW_AT_type        : <0x2d3>
    <4ff>   DW_AT_data_member_location: 168
 <2><500>: Abbrev Number: 16 (DW_TAG_member)
    <501>   DW_AT_name        : (indirect string, offset: 0x790b8): RESERVED9
    <505>   DW_AT_decl_file   : 7
    <506>   DW_AT_decl_line   : 206
    <507>   DW_AT_decl_column : 17
    <508>   DW_AT_type        : <0x2d3>
    <50c>   DW_AT_data_member_location: 172
 <2><50d>: Abbrev Number: 16 (DW_TAG_member)
    <50e>   DW_AT_name        : (indirect string, offset: 0x49f2b): DIFSEL
    <512>   DW_AT_decl_file   : 7
    <513>   DW_AT_decl_line   : 207
    <514>   DW_AT_decl_column : 17
    <515>   DW_AT_type        : <0x2df>
    <519>   DW_AT_data_member_location: 176
 <2><51a>: Abbrev Number: 16 (DW_TAG_member)
    <51b>   DW_AT_name        : (indirect string, offset: 0x44277): CALFACT
    <51f>   DW_AT_decl_file   : 7
    <520>   DW_AT_decl_line   : 208
    <521>   DW_AT_decl_column : 17
    <522>   DW_AT_type        : <0x2df>
    <526>   DW_AT_data_member_location: 180
 <2><527>: Abbrev Number: 0
 <1><528>: Abbrev Number: 12 (DW_TAG_array_type)
    <529>   DW_AT_type        : <0x2d3>
    <52d>   DW_AT_sibling     : <0x538>
 <2><531>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <532>   DW_AT_type        : <0x299>
    <536>   DW_AT_upper_bound : 3
 <2><537>: Abbrev Number: 0
 <1><538>: Abbrev Number: 6 (DW_TAG_typedef)
    <539>   DW_AT_name        : (indirect string, offset: 0x9be13): ADC_TypeDef
    <53d>   DW_AT_decl_file   : 7
    <53e>   DW_AT_decl_line   : 210
    <53f>   DW_AT_decl_column : 3
    <540>   DW_AT_type        : <0x33f>
 <1><544>: Abbrev Number: 17 (DW_TAG_structure_type)
    <545>   DW_AT_byte_size   : 16
    <546>   DW_AT_decl_file   : 7
    <547>   DW_AT_decl_line   : 348
    <549>   DW_AT_decl_column : 9
    <54a>   DW_AT_sibling     : <0x587>
 <2><54e>: Abbrev Number: 18 (DW_TAG_member)
    <54f>   DW_AT_name        : CCR
    <553>   DW_AT_decl_file   : 7
    <554>   DW_AT_decl_line   : 350
    <556>   DW_AT_decl_column : 17
    <557>   DW_AT_type        : <0x2df>
    <55b>   DW_AT_data_member_location: 0
 <2><55c>: Abbrev Number: 19 (DW_TAG_member)
    <55d>   DW_AT_name        : (indirect string, offset: 0x606bb): CNDTR
    <561>   DW_AT_decl_file   : 7
    <562>   DW_AT_decl_line   : 351
    <564>   DW_AT_decl_column : 17
    <565>   DW_AT_type        : <0x2df>
    <569>   DW_AT_data_member_location: 4
 <2><56a>: Abbrev Number: 19 (DW_TAG_member)
    <56b>   DW_AT_name        : (indirect string, offset: 0xc3d79): CPAR
    <56f>   DW_AT_decl_file   : 7
    <570>   DW_AT_decl_line   : 352
    <572>   DW_AT_decl_column : 17
    <573>   DW_AT_type        : <0x2df>
    <577>   DW_AT_data_member_location: 8
 <2><578>: Abbrev Number: 19 (DW_TAG_member)
    <579>   DW_AT_name        : (indirect string, offset: 0x709d4): CMAR
    <57d>   DW_AT_decl_file   : 7
    <57e>   DW_AT_decl_line   : 353
    <580>   DW_AT_decl_column : 17
    <581>   DW_AT_type        : <0x2df>
    <585>   DW_AT_data_member_location: 12
 <2><586>: Abbrev Number: 0
 <1><587>: Abbrev Number: 20 (DW_TAG_typedef)
    <588>   DW_AT_name        : (indirect string, offset: 0xa51cb): DMA_Channel_TypeDef
    <58c>   DW_AT_decl_file   : 7
    <58d>   DW_AT_decl_line   : 354
    <58f>   DW_AT_decl_column : 3
    <590>   DW_AT_type        : <0x544>
 <1><594>: Abbrev Number: 17 (DW_TAG_structure_type)
    <595>   DW_AT_byte_size   : 8
    <596>   DW_AT_decl_file   : 7
    <597>   DW_AT_decl_line   : 356
    <599>   DW_AT_decl_column : 9
    <59a>   DW_AT_sibling     : <0x5bb>
 <2><59e>: Abbrev Number: 18 (DW_TAG_member)
    <59f>   DW_AT_name        : ISR
    <5a3>   DW_AT_decl_file   : 7
    <5a4>   DW_AT_decl_line   : 358
    <5a6>   DW_AT_decl_column : 17
    <5a7>   DW_AT_type        : <0x2df>
    <5ab>   DW_AT_data_member_location: 0
 <2><5ac>: Abbrev Number: 19 (DW_TAG_member)
    <5ad>   DW_AT_name        : (indirect string, offset: 0x8e84e): IFCR
    <5b1>   DW_AT_decl_file   : 7
    <5b2>   DW_AT_decl_line   : 359
    <5b4>   DW_AT_decl_column : 17
    <5b5>   DW_AT_type        : <0x2df>
    <5b9>   DW_AT_data_member_location: 4
 <2><5ba>: Abbrev Number: 0
 <1><5bb>: Abbrev Number: 20 (DW_TAG_typedef)
    <5bc>   DW_AT_name        : (indirect string, offset: 0x4aa1c): DMA_TypeDef
    <5c0>   DW_AT_decl_file   : 7
    <5c1>   DW_AT_decl_line   : 360
    <5c3>   DW_AT_decl_column : 3
    <5c4>   DW_AT_type        : <0x594>
 <1><5c8>: Abbrev Number: 17 (DW_TAG_structure_type)
    <5c9>   DW_AT_byte_size   : 44
    <5ca>   DW_AT_decl_file   : 7
    <5cb>   DW_AT_decl_line   : 474
    <5cd>   DW_AT_decl_column : 9
    <5ce>   DW_AT_sibling     : <0x65f>
 <2><5d2>: Abbrev Number: 19 (DW_TAG_member)
    <5d3>   DW_AT_name        : (indirect string, offset: 0x8468a): MODER
    <5d7>   DW_AT_decl_file   : 7
    <5d8>   DW_AT_decl_line   : 476
    <5da>   DW_AT_decl_column : 17
    <5db>   DW_AT_type        : <0x2df>
    <5df>   DW_AT_data_member_location: 0
 <2><5e0>: Abbrev Number: 19 (DW_TAG_member)
    <5e1>   DW_AT_name        : (indirect string, offset: 0x9d2b2): OTYPER
    <5e5>   DW_AT_decl_file   : 7
    <5e6>   DW_AT_decl_line   : 477
    <5e8>   DW_AT_decl_column : 17
    <5e9>   DW_AT_type        : <0x2df>
    <5ed>   DW_AT_data_member_location: 4
 <2><5ee>: Abbrev Number: 19 (DW_TAG_member)
    <5ef>   DW_AT_name        : (indirect string, offset: 0xb105c): OSPEEDR
    <5f3>   DW_AT_decl_file   : 7
    <5f4>   DW_AT_decl_line   : 478
    <5f6>   DW_AT_decl_column : 17
    <5f7>   DW_AT_type        : <0x2df>
    <5fb>   DW_AT_data_member_location: 8
 <2><5fc>: Abbrev Number: 19 (DW_TAG_member)
    <5fd>   DW_AT_name        : (indirect string, offset: 0x83717): PUPDR
    <601>   DW_AT_decl_file   : 7
    <602>   DW_AT_decl_line   : 479
    <604>   DW_AT_decl_column : 17
    <605>   DW_AT_type        : <0x2df>
    <609>   DW_AT_data_member_location: 12
 <2><60a>: Abbrev Number: 18 (DW_TAG_member)
    <60b>   DW_AT_name        : IDR
    <60f>   DW_AT_decl_file   : 7
    <610>   DW_AT_decl_line   : 480
    <612>   DW_AT_decl_column : 17
    <613>   DW_AT_type        : <0x2df>
    <617>   DW_AT_data_member_location: 16
 <2><618>: Abbrev Number: 18 (DW_TAG_member)
    <619>   DW_AT_name        : ODR
    <61d>   DW_AT_decl_file   : 7
    <61e>   DW_AT_decl_line   : 481
    <620>   DW_AT_decl_column : 17
    <621>   DW_AT_type        : <0x2df>
    <625>   DW_AT_data_member_location: 20
 <2><626>: Abbrev Number: 19 (DW_TAG_member)
    <627>   DW_AT_name        : (indirect string, offset: 0x2d0e3): BSRR
    <62b>   DW_AT_decl_file   : 7
    <62c>   DW_AT_decl_line   : 482
    <62e>   DW_AT_decl_column : 17
    <62f>   DW_AT_type        : <0x2df>
    <633>   DW_AT_data_member_location: 24
 <2><634>: Abbrev Number: 19 (DW_TAG_member)
    <635>   DW_AT_name        : (indirect string, offset: 0x6f74e): LCKR
    <639>   DW_AT_decl_file   : 7
    <63a>   DW_AT_decl_line   : 483
    <63c>   DW_AT_decl_column : 17
    <63d>   DW_AT_type        : <0x2df>
    <641>   DW_AT_data_member_location: 28
 <2><642>: Abbrev Number: 18 (DW_TAG_member)
    <643>   DW_AT_name        : AFR
    <647>   DW_AT_decl_file   : 7
    <648>   DW_AT_decl_line   : 484
    <64a>   DW_AT_decl_column : 17
    <64b>   DW_AT_type        : <0x66f>
    <64f>   DW_AT_data_member_location: 32
 <2><650>: Abbrev Number: 18 (DW_TAG_member)
    <651>   DW_AT_name        : BRR
    <655>   DW_AT_decl_file   : 7
    <656>   DW_AT_decl_line   : 485
    <658>   DW_AT_decl_column : 17
    <659>   DW_AT_type        : <0x2df>
    <65d>   DW_AT_data_member_location: 40
 <2><65e>: Abbrev Number: 0
 <1><65f>: Abbrev Number: 12 (DW_TAG_array_type)
    <660>   DW_AT_type        : <0x2df>
    <664>   DW_AT_sibling     : <0x66f>
 <2><668>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <669>   DW_AT_type        : <0x299>
    <66d>   DW_AT_upper_bound : 1
 <2><66e>: Abbrev Number: 0
 <1><66f>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <670>   DW_AT_type        : <0x65f>
 <1><674>: Abbrev Number: 20 (DW_TAG_typedef)
    <675>   DW_AT_name        : (indirect string, offset: 0xc4e64): GPIO_TypeDef
    <679>   DW_AT_decl_file   : 7
    <67a>   DW_AT_decl_line   : 486
    <67c>   DW_AT_decl_column : 2
    <67d>   DW_AT_type        : <0x5c8>
 <1><681>: Abbrev Number: 17 (DW_TAG_structure_type)
    <682>   DW_AT_byte_size   : 52
    <683>   DW_AT_decl_file   : 7
    <684>   DW_AT_decl_line   : 568
    <686>   DW_AT_decl_column : 9
    <687>   DW_AT_sibling     : <0x741>
 <2><68b>: Abbrev Number: 18 (DW_TAG_member)
    <68c>   DW_AT_name        : CR
    <68f>   DW_AT_decl_file   : 7
    <690>   DW_AT_decl_line   : 570
    <692>   DW_AT_decl_column : 17
    <693>   DW_AT_type        : <0x2df>
    <697>   DW_AT_data_member_location: 0
 <2><698>: Abbrev Number: 19 (DW_TAG_member)
    <699>   DW_AT_name        : (indirect string, offset: 0xce43b): CFGR
    <69d>   DW_AT_decl_file   : 7
    <69e>   DW_AT_decl_line   : 571
    <6a0>   DW_AT_decl_column : 17
    <6a1>   DW_AT_type        : <0x2df>
    <6a5>   DW_AT_data_member_location: 4
 <2><6a6>: Abbrev Number: 18 (DW_TAG_member)
    <6a7>   DW_AT_name        : CIR
    <6ab>   DW_AT_decl_file   : 7
    <6ac>   DW_AT_decl_line   : 572
    <6ae>   DW_AT_decl_column : 17
    <6af>   DW_AT_type        : <0x2df>
    <6b3>   DW_AT_data_member_location: 8
 <2><6b4>: Abbrev Number: 19 (DW_TAG_member)
    <6b5>   DW_AT_name        : (indirect string, offset: 0x580b4): APB2RSTR
    <6b9>   DW_AT_decl_file   : 7
    <6ba>   DW_AT_decl_line   : 573
    <6bc>   DW_AT_decl_column : 17
    <6bd>   DW_AT_type        : <0x2df>
    <6c1>   DW_AT_data_member_location: 12
 <2><6c2>: Abbrev Number: 19 (DW_TAG_member)
    <6c3>   DW_AT_name        : (indirect string, offset: 0x1664c): APB1RSTR
    <6c7>   DW_AT_decl_file   : 7
    <6c8>   DW_AT_decl_line   : 574
    <6ca>   DW_AT_decl_column : 17
    <6cb>   DW_AT_type        : <0x2df>
    <6cf>   DW_AT_data_member_location: 16
 <2><6d0>: Abbrev Number: 19 (DW_TAG_member)
    <6d1>   DW_AT_name        : (indirect string, offset: 0xba01b): AHBENR
    <6d5>   DW_AT_decl_file   : 7
    <6d6>   DW_AT_decl_line   : 575
    <6d8>   DW_AT_decl_column : 17
    <6d9>   DW_AT_type        : <0x2df>
    <6dd>   DW_AT_data_member_location: 20
 <2><6de>: Abbrev Number: 19 (DW_TAG_member)
    <6df>   DW_AT_name        : (indirect string, offset: 0x177bd): APB2ENR
    <6e3>   DW_AT_decl_file   : 7
    <6e4>   DW_AT_decl_line   : 576
    <6e6>   DW_AT_decl_column : 17
    <6e7>   DW_AT_type        : <0x2df>
    <6eb>   DW_AT_data_member_location: 24
 <2><6ec>: Abbrev Number: 19 (DW_TAG_member)
    <6ed>   DW_AT_name        : (indirect string, offset: 0x75196): APB1ENR
    <6f1>   DW_AT_decl_file   : 7
    <6f2>   DW_AT_decl_line   : 577
    <6f4>   DW_AT_decl_column : 17
    <6f5>   DW_AT_type        : <0x2df>
    <6f9>   DW_AT_data_member_location: 28
 <2><6fa>: Abbrev Number: 19 (DW_TAG_member)
    <6fb>   DW_AT_name        : (indirect string, offset: 0x3559d): BDCR
    <6ff>   DW_AT_decl_file   : 7
    <700>   DW_AT_decl_line   : 578
    <702>   DW_AT_decl_column : 17
    <703>   DW_AT_type        : <0x2df>
    <707>   DW_AT_data_member_location: 32
 <2><708>: Abbrev Number: 18 (DW_TAG_member)
    <709>   DW_AT_name        : CSR
    <70d>   DW_AT_decl_file   : 7
    <70e>   DW_AT_decl_line   : 579
    <710>   DW_AT_decl_column : 17
    <711>   DW_AT_type        : <0x2df>
    <715>   DW_AT_data_member_location: 36
 <2><716>: Abbrev Number: 19 (DW_TAG_member)
    <717>   DW_AT_name        : (indirect string, offset: 0xfa45): AHBRSTR
    <71b>   DW_AT_decl_file   : 7
    <71c>   DW_AT_decl_line   : 580
    <71e>   DW_AT_decl_column : 17
    <71f>   DW_AT_type        : <0x2df>
    <723>   DW_AT_data_member_location: 40
 <2><724>: Abbrev Number: 19 (DW_TAG_member)
    <725>   DW_AT_name        : (indirect string, offset: 0x778c9): CFGR2
    <729>   DW_AT_decl_file   : 7
    <72a>   DW_AT_decl_line   : 581
    <72c>   DW_AT_decl_column : 17
    <72d>   DW_AT_type        : <0x2df>
    <731>   DW_AT_data_member_location: 44
 <2><732>: Abbrev Number: 19 (DW_TAG_member)
    <733>   DW_AT_name        : (indirect string, offset: 0x56f9e): CFGR3
    <737>   DW_AT_decl_file   : 7
    <738>   DW_AT_decl_line   : 582
    <73a>   DW_AT_decl_column : 17
    <73b>   DW_AT_type        : <0x2df>
    <73f>   DW_AT_data_member_location: 48
 <2><740>: Abbrev Number: 0
 <1><741>: Abbrev Number: 20 (DW_TAG_typedef)
    <742>   DW_AT_name        : (indirect string, offset: 0x5de25): RCC_TypeDef
    <746>   DW_AT_decl_file   : 7
    <747>   DW_AT_decl_line   : 583
    <749>   DW_AT_decl_column : 3
    <74a>   DW_AT_type        : <0x681>
 <1><74e>: Abbrev Number: 17 (DW_TAG_structure_type)
    <74f>   DW_AT_byte_size   : 44
    <750>   DW_AT_decl_file   : 7
    <751>   DW_AT_decl_line   : 703
    <753>   DW_AT_decl_column : 9
    <754>   DW_AT_sibling     : <0x80f>
 <2><758>: Abbrev Number: 18 (DW_TAG_member)
    <759>   DW_AT_name        : CR1
    <75d>   DW_AT_decl_file   : 7
    <75e>   DW_AT_decl_line   : 705
    <760>   DW_AT_decl_column : 17
    <761>   DW_AT_type        : <0x2df>
    <765>   DW_AT_data_member_location: 0
 <2><766>: Abbrev Number: 18 (DW_TAG_member)
    <767>   DW_AT_name        : CR2
    <76b>   DW_AT_decl_file   : 7
    <76c>   DW_AT_decl_line   : 706
    <76e>   DW_AT_decl_column : 17
    <76f>   DW_AT_type        : <0x2df>
    <773>   DW_AT_data_member_location: 4
 <2><774>: Abbrev Number: 18 (DW_TAG_member)
    <775>   DW_AT_name        : CR3
    <779>   DW_AT_decl_file   : 7
    <77a>   DW_AT_decl_line   : 707
    <77c>   DW_AT_decl_column : 17
    <77d>   DW_AT_type        : <0x2df>
    <781>   DW_AT_data_member_location: 8
 <2><782>: Abbrev Number: 18 (DW_TAG_member)
    <783>   DW_AT_name        : BRR
    <787>   DW_AT_decl_file   : 7
    <788>   DW_AT_decl_line   : 708
    <78a>   DW_AT_decl_column : 17
    <78b>   DW_AT_type        : <0x2df>
    <78f>   DW_AT_data_member_location: 12
 <2><790>: Abbrev Number: 19 (DW_TAG_member)
    <791>   DW_AT_name        : (indirect string, offset: 0x38fbd): GTPR
    <795>   DW_AT_decl_file   : 7
    <796>   DW_AT_decl_line   : 709
    <798>   DW_AT_decl_column : 17
    <799>   DW_AT_type        : <0x2df>
    <79d>   DW_AT_data_member_location: 16
 <2><79e>: Abbrev Number: 19 (DW_TAG_member)
    <79f>   DW_AT_name        : (indirect string, offset: 0xb3208): RTOR
    <7a3>   DW_AT_decl_file   : 7
    <7a4>   DW_AT_decl_line   : 710
    <7a6>   DW_AT_decl_column : 17
    <7a7>   DW_AT_type        : <0x2df>
    <7ab>   DW_AT_data_member_location: 20
 <2><7ac>: Abbrev Number: 18 (DW_TAG_member)
    <7ad>   DW_AT_name        : RQR
    <7b1>   DW_AT_decl_file   : 7
    <7b2>   DW_AT_decl_line   : 711
    <7b4>   DW_AT_decl_column : 17
    <7b5>   DW_AT_type        : <0x2df>
    <7b9>   DW_AT_data_member_location: 24
 <2><7ba>: Abbrev Number: 18 (DW_TAG_member)
    <7bb>   DW_AT_name        : ISR
    <7bf>   DW_AT_decl_file   : 7
    <7c0>   DW_AT_decl_line   : 712
    <7c2>   DW_AT_decl_column : 17
    <7c3>   DW_AT_type        : <0x2df>
    <7c7>   DW_AT_data_member_location: 28
 <2><7c8>: Abbrev Number: 18 (DW_TAG_member)
    <7c9>   DW_AT_name        : ICR
    <7cd>   DW_AT_decl_file   : 7
    <7ce>   DW_AT_decl_line   : 713
    <7d0>   DW_AT_decl_column : 17
    <7d1>   DW_AT_type        : <0x2df>
    <7d5>   DW_AT_data_member_location: 32
 <2><7d6>: Abbrev Number: 18 (DW_TAG_member)
    <7d7>   DW_AT_name        : RDR
    <7db>   DW_AT_decl_file   : 7
    <7dc>   DW_AT_decl_line   : 714
    <7de>   DW_AT_decl_column : 17
    <7df>   DW_AT_type        : <0x2bd>
    <7e3>   DW_AT_data_member_location: 36
 <2><7e4>: Abbrev Number: 19 (DW_TAG_member)
    <7e5>   DW_AT_name        : (indirect string, offset: 0xbf368): RESERVED1
    <7e9>   DW_AT_decl_file   : 7
    <7ea>   DW_AT_decl_line   : 715
    <7ec>   DW_AT_decl_column : 13
    <7ed>   DW_AT_type        : <0x2b1>
    <7f1>   DW_AT_data_member_location: 38
 <2><7f2>: Abbrev Number: 18 (DW_TAG_member)
    <7f3>   DW_AT_name        : TDR
    <7f7>   DW_AT_decl_file   : 7
    <7f8>   DW_AT_decl_line   : 716
    <7fa>   DW_AT_decl_column : 17
    <7fb>   DW_AT_type        : <0x2bd>
    <7ff>   DW_AT_data_member_location: 40
 <2><800>: Abbrev Number: 19 (DW_TAG_member)
    <801>   DW_AT_name        : (indirect string, offset: 0xbf372): RESERVED2
    <805>   DW_AT_decl_file   : 7
    <806>   DW_AT_decl_line   : 717
    <808>   DW_AT_decl_column : 13
    <809>   DW_AT_type        : <0x2b1>
    <80d>   DW_AT_data_member_location: 42
 <2><80e>: Abbrev Number: 0
 <1><80f>: Abbrev Number: 20 (DW_TAG_typedef)
    <810>   DW_AT_name        : (indirect string, offset: 0x6cae7): USART_TypeDef
    <814>   DW_AT_decl_file   : 7
    <815>   DW_AT_decl_line   : 718
    <817>   DW_AT_decl_column : 3
    <818>   DW_AT_type        : <0x74e>
 <1><81c>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <81d>   DW_AT_encoding    : 7	(unsigned)
    <81e>   DW_AT_byte_size   : 1
    <81f>   DW_AT_type        : <0x23d>
    <823>   DW_AT_decl_file   : 8
    <824>   DW_AT_decl_line   : 170
    <825>   DW_AT_decl_column : 1
    <826>   DW_AT_sibling     : <0x837>
 <2><82a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <82b>   DW_AT_name        : (indirect string, offset: 0xb74de): DISABLE
    <82f>   DW_AT_const_value : 0
 <2><830>: Abbrev Number: 4 (DW_TAG_enumerator)
    <831>   DW_AT_name        : (indirect string, offset: 0x2c27a): ENABLE
    <835>   DW_AT_const_value : 1
 <2><836>: Abbrev Number: 0
 <1><837>: Abbrev Number: 6 (DW_TAG_typedef)
    <838>   DW_AT_name        : (indirect string, offset: 0xc9bc0): FunctionalState
    <83c>   DW_AT_decl_file   : 8
    <83d>   DW_AT_decl_line   : 173
    <83e>   DW_AT_decl_column : 3
    <83f>   DW_AT_type        : <0x81c>
 <1><843>: Abbrev Number: 5 (DW_TAG_base_type)
    <844>   DW_AT_byte_size   : 8
    <845>   DW_AT_encoding    : 4	(float)
    <846>   DW_AT_name        : (indirect string, offset: 0x11f22): long double
 <1><84a>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <84b>   DW_AT_encoding    : 7	(unsigned)
    <84c>   DW_AT_byte_size   : 1
    <84d>   DW_AT_type        : <0x23d>
    <851>   DW_AT_decl_file   : 9
    <852>   DW_AT_decl_line   : 39
    <853>   DW_AT_decl_column : 1
    <854>   DW_AT_sibling     : <0x871>
 <2><858>: Abbrev Number: 4 (DW_TAG_enumerator)
    <859>   DW_AT_name        : (indirect string, offset: 0x44e6e): HAL_OK
    <85d>   DW_AT_const_value : 0
 <2><85e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <85f>   DW_AT_name        : (indirect string, offset: 0x7f011): HAL_ERROR
    <863>   DW_AT_const_value : 1
 <2><864>: Abbrev Number: 4 (DW_TAG_enumerator)
    <865>   DW_AT_name        : (indirect string, offset: 0x233be): HAL_BUSY
    <869>   DW_AT_const_value : 2
 <2><86a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <86b>   DW_AT_name        : (indirect string, offset: 0x3c0fd): HAL_TIMEOUT
    <86f>   DW_AT_const_value : 3
 <2><870>: Abbrev Number: 0
 <1><871>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <872>   DW_AT_encoding    : 7	(unsigned)
    <873>   DW_AT_byte_size   : 1
    <874>   DW_AT_type        : <0x23d>
    <878>   DW_AT_decl_file   : 9
    <879>   DW_AT_decl_line   : 50
    <87a>   DW_AT_decl_column : 1
    <87b>   DW_AT_sibling     : <0x88c>
 <2><87f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <880>   DW_AT_name        : (indirect string, offset: 0x965a2): HAL_UNLOCKED
    <884>   DW_AT_const_value : 0
 <2><885>: Abbrev Number: 4 (DW_TAG_enumerator)
    <886>   DW_AT_name        : (indirect string, offset: 0xca6c7): HAL_LOCKED
    <88a>   DW_AT_const_value : 1
 <2><88b>: Abbrev Number: 0
 <1><88c>: Abbrev Number: 6 (DW_TAG_typedef)
    <88d>   DW_AT_name        : (indirect string, offset: 0x77f47): HAL_LockTypeDef
    <891>   DW_AT_decl_file   : 9
    <892>   DW_AT_decl_line   : 53
    <893>   DW_AT_decl_column : 3
    <894>   DW_AT_type        : <0x871>
 <1><898>: Abbrev Number: 14 (DW_TAG_structure_type)
    <899>   DW_AT_byte_size   : 16
    <89a>   DW_AT_decl_file   : 10
    <89b>   DW_AT_decl_line   : 249
    <89c>   DW_AT_decl_column : 9
    <89d>   DW_AT_sibling     : <0x8d8>
 <2><8a1>: Abbrev Number: 16 (DW_TAG_member)
    <8a2>   DW_AT_name        : (indirect string, offset: 0x887a6): PLLState
    <8a6>   DW_AT_decl_file   : 10
    <8a7>   DW_AT_decl_line   : 251
    <8a8>   DW_AT_decl_column : 12
    <8a9>   DW_AT_type        : <0x2d3>
    <8ad>   DW_AT_data_member_location: 0
 <2><8ae>: Abbrev Number: 16 (DW_TAG_member)
    <8af>   DW_AT_name        : (indirect string, offset: 0x8d9ad): PLLSource
    <8b3>   DW_AT_decl_file   : 10
    <8b4>   DW_AT_decl_line   : 254
    <8b5>   DW_AT_decl_column : 12
    <8b6>   DW_AT_type        : <0x2d3>
    <8ba>   DW_AT_data_member_location: 4
 <2><8bb>: Abbrev Number: 19 (DW_TAG_member)
    <8bc>   DW_AT_name        : (indirect string, offset: 0xb63df): PLLMUL
    <8c0>   DW_AT_decl_file   : 10
    <8c1>   DW_AT_decl_line   : 257
    <8c3>   DW_AT_decl_column : 12
    <8c4>   DW_AT_type        : <0x2d3>
    <8c8>   DW_AT_data_member_location: 8
 <2><8c9>: Abbrev Number: 19 (DW_TAG_member)
    <8ca>   DW_AT_name        : (indirect string, offset: 0x9c23d): PREDIV
    <8ce>   DW_AT_decl_file   : 10
    <8cf>   DW_AT_decl_line   : 261
    <8d1>   DW_AT_decl_column : 12
    <8d2>   DW_AT_type        : <0x2d3>
    <8d6>   DW_AT_data_member_location: 12
 <2><8d7>: Abbrev Number: 0
 <1><8d8>: Abbrev Number: 20 (DW_TAG_typedef)
    <8d9>   DW_AT_name        : (indirect string, offset: 0x7ad58): RCC_PLLInitTypeDef
    <8dd>   DW_AT_decl_file   : 10
    <8de>   DW_AT_decl_line   : 265
    <8e0>   DW_AT_decl_column : 3
    <8e1>   DW_AT_type        : <0x898>
 <1><8e5>: Abbrev Number: 17 (DW_TAG_structure_type)
    <8e6>   DW_AT_byte_size   : 40
    <8e7>   DW_AT_decl_file   : 10
    <8e8>   DW_AT_decl_line   : 270
    <8ea>   DW_AT_decl_column : 9
    <8eb>   DW_AT_sibling     : <0x952>
 <2><8ef>: Abbrev Number: 19 (DW_TAG_member)
    <8f0>   DW_AT_name        : (indirect string, offset: 0xa594f): OscillatorType
    <8f4>   DW_AT_decl_file   : 10
    <8f5>   DW_AT_decl_line   : 272
    <8f7>   DW_AT_decl_column : 12
    <8f8>   DW_AT_type        : <0x2d3>
    <8fc>   DW_AT_data_member_location: 0
 <2><8fd>: Abbrev Number: 19 (DW_TAG_member)
    <8fe>   DW_AT_name        : (indirect string, offset: 0x8a708): HSEState
    <902>   DW_AT_decl_file   : 10
    <903>   DW_AT_decl_line   : 275
    <905>   DW_AT_decl_column : 12
    <906>   DW_AT_type        : <0x2d3>
    <90a>   DW_AT_data_member_location: 4
 <2><90b>: Abbrev Number: 19 (DW_TAG_member)
    <90c>   DW_AT_name        : (indirect string, offset: 0x7f8d8): LSEState
    <910>   DW_AT_decl_file   : 10
    <911>   DW_AT_decl_line   : 283
    <913>   DW_AT_decl_column : 12
    <914>   DW_AT_type        : <0x2d3>
    <918>   DW_AT_data_member_location: 8
 <2><919>: Abbrev Number: 19 (DW_TAG_member)
    <91a>   DW_AT_name        : (indirect string, offset: 0x5a7f8): HSIState
    <91e>   DW_AT_decl_file   : 10
    <91f>   DW_AT_decl_line   : 286
    <921>   DW_AT_decl_column : 12
    <922>   DW_AT_type        : <0x2d3>
    <926>   DW_AT_data_member_location: 12
 <2><927>: Abbrev Number: 19 (DW_TAG_member)
    <928>   DW_AT_name        : (indirect string, offset: 0xaf233): HSICalibrationValue
    <92c>   DW_AT_decl_file   : 10
    <92d>   DW_AT_decl_line   : 289
    <92f>   DW_AT_decl_column : 12
    <930>   DW_AT_type        : <0x2d3>
    <934>   DW_AT_data_member_location: 16
 <2><935>: Abbrev Number: 19 (DW_TAG_member)
    <936>   DW_AT_name        : (indirect string, offset: 0xb5608): LSIState
    <93a>   DW_AT_decl_file   : 10
    <93b>   DW_AT_decl_line   : 292
    <93d>   DW_AT_decl_column : 12
    <93e>   DW_AT_type        : <0x2d3>
    <942>   DW_AT_data_member_location: 20
 <2><943>: Abbrev Number: 18 (DW_TAG_member)
    <944>   DW_AT_name        : PLL
    <948>   DW_AT_decl_file   : 10
    <949>   DW_AT_decl_line   : 295
    <94b>   DW_AT_decl_column : 22
    <94c>   DW_AT_type        : <0x8d8>
    <950>   DW_AT_data_member_location: 24
 <2><951>: Abbrev Number: 0
 <1><952>: Abbrev Number: 20 (DW_TAG_typedef)
    <953>   DW_AT_name        : (indirect string, offset: 0x6bf56): RCC_OscInitTypeDef
    <957>   DW_AT_decl_file   : 10
    <958>   DW_AT_decl_line   : 297
    <95a>   DW_AT_decl_column : 3
    <95b>   DW_AT_type        : <0x8e5>
 <1><95f>: Abbrev Number: 17 (DW_TAG_structure_type)
    <960>   DW_AT_byte_size   : 20
    <961>   DW_AT_decl_file   : 10
    <962>   DW_AT_decl_line   : 302
    <964>   DW_AT_decl_column : 9
    <965>   DW_AT_sibling     : <0x9b0>
 <2><969>: Abbrev Number: 19 (DW_TAG_member)
    <96a>   DW_AT_name        : (indirect string, offset: 0x3e84f): ClockType
    <96e>   DW_AT_decl_file   : 10
    <96f>   DW_AT_decl_line   : 304
    <971>   DW_AT_decl_column : 12
    <972>   DW_AT_type        : <0x2d3>
    <976>   DW_AT_data_member_location: 0
 <2><977>: Abbrev Number: 19 (DW_TAG_member)
    <978>   DW_AT_name        : (indirect string, offset: 0x7a878): SYSCLKSource
    <97c>   DW_AT_decl_file   : 10
    <97d>   DW_AT_decl_line   : 307
    <97f>   DW_AT_decl_column : 12
    <980>   DW_AT_type        : <0x2d3>
    <984>   DW_AT_data_member_location: 4
 <2><985>: Abbrev Number: 19 (DW_TAG_member)
    <986>   DW_AT_name        : (indirect string, offset: 0xa805f): AHBCLKDivider
    <98a>   DW_AT_decl_file   : 10
    <98b>   DW_AT_decl_line   : 310
    <98d>   DW_AT_decl_column : 12
    <98e>   DW_AT_type        : <0x2d3>
    <992>   DW_AT_data_member_location: 8
 <2><993>: Abbrev Number: 19 (DW_TAG_member)
    <994>   DW_AT_name        : (indirect string, offset: 0x18335): APB1CLKDivider
    <998>   DW_AT_decl_file   : 10
    <999>   DW_AT_decl_line   : 313
    <99b>   DW_AT_decl_column : 12
    <99c>   DW_AT_type        : <0x2d3>
    <9a0>   DW_AT_data_member_location: 12
 <2><9a1>: Abbrev Number: 19 (DW_TAG_member)
    <9a2>   DW_AT_name        : (indirect string, offset: 0x5cc2f): APB2CLKDivider
    <9a6>   DW_AT_decl_file   : 10
    <9a7>   DW_AT_decl_line   : 316
    <9a9>   DW_AT_decl_column : 12
    <9aa>   DW_AT_type        : <0x2d3>
    <9ae>   DW_AT_data_member_location: 16
 <2><9af>: Abbrev Number: 0
 <1><9b0>: Abbrev Number: 20 (DW_TAG_typedef)
    <9b1>   DW_AT_name        : (indirect string, offset: 0x9cce3): RCC_ClkInitTypeDef
    <9b5>   DW_AT_decl_file   : 10
    <9b6>   DW_AT_decl_line   : 318
    <9b8>   DW_AT_decl_column : 3
    <9b9>   DW_AT_type        : <0x95f>
 <1><9bd>: Abbrev Number: 17 (DW_TAG_structure_type)
    <9be>   DW_AT_byte_size   : 88
    <9bf>   DW_AT_decl_file   : 11
    <9c0>   DW_AT_decl_line   : 598
    <9c2>   DW_AT_decl_column : 9
    <9c3>   DW_AT_sibling     : <0xafc>
 <2><9c7>: Abbrev Number: 19 (DW_TAG_member)
    <9c8>   DW_AT_name        : (indirect string, offset: 0xac848): PeriphClockSelection
    <9cc>   DW_AT_decl_file   : 11
    <9cd>   DW_AT_decl_line   : 600
    <9cf>   DW_AT_decl_column : 12
    <9d0>   DW_AT_type        : <0x2d3>
    <9d4>   DW_AT_data_member_location: 0
 <2><9d5>: Abbrev Number: 19 (DW_TAG_member)
    <9d6>   DW_AT_name        : (indirect string, offset: 0x5642f): RTCClockSelection
    <9da>   DW_AT_decl_file   : 11
    <9db>   DW_AT_decl_line   : 603
    <9dd>   DW_AT_decl_column : 12
    <9de>   DW_AT_type        : <0x2d3>
    <9e2>   DW_AT_data_member_location: 4
 <2><9e3>: Abbrev Number: 19 (DW_TAG_member)
    <9e4>   DW_AT_name        : (indirect string, offset: 0x6da0a): Usart1ClockSelection
    <9e8>   DW_AT_decl_file   : 11
    <9e9>   DW_AT_decl_line   : 606
    <9eb>   DW_AT_decl_column : 12
    <9ec>   DW_AT_type        : <0x2d3>
    <9f0>   DW_AT_data_member_location: 8
 <2><9f1>: Abbrev Number: 19 (DW_TAG_member)
    <9f2>   DW_AT_name        : (indirect string, offset: 0x9c46c): Usart2ClockSelection
    <9f6>   DW_AT_decl_file   : 11
    <9f7>   DW_AT_decl_line   : 609
    <9f9>   DW_AT_decl_column : 12
    <9fa>   DW_AT_type        : <0x2d3>
    <9fe>   DW_AT_data_member_location: 12
 <2><9ff>: Abbrev Number: 19 (DW_TAG_member)
    <a00>   DW_AT_name        : (indirect string, offset: 0x7d11): Usart3ClockSelection
    <a04>   DW_AT_decl_file   : 11
    <a05>   DW_AT_decl_line   : 612
    <a07>   DW_AT_decl_column : 12
    <a08>   DW_AT_type        : <0x2d3>
    <a0c>   DW_AT_data_member_location: 16
 <2><a0d>: Abbrev Number: 19 (DW_TAG_member)
    <a0e>   DW_AT_name        : (indirect string, offset: 0x1fd8b): Uart4ClockSelection
    <a12>   DW_AT_decl_file   : 11
    <a13>   DW_AT_decl_line   : 615
    <a15>   DW_AT_decl_column : 12
    <a16>   DW_AT_type        : <0x2d3>
    <a1a>   DW_AT_data_member_location: 20
 <2><a1b>: Abbrev Number: 19 (DW_TAG_member)
    <a1c>   DW_AT_name        : (indirect string, offset: 0xa7443): Uart5ClockSelection
    <a20>   DW_AT_decl_file   : 11
    <a21>   DW_AT_decl_line   : 618
    <a23>   DW_AT_decl_column : 12
    <a24>   DW_AT_type        : <0x2d3>
    <a28>   DW_AT_data_member_location: 24
 <2><a29>: Abbrev Number: 19 (DW_TAG_member)
    <a2a>   DW_AT_name        : (indirect string, offset: 0x94d04): I2c1ClockSelection
    <a2e>   DW_AT_decl_file   : 11
    <a2f>   DW_AT_decl_line   : 621
    <a31>   DW_AT_decl_column : 12
    <a32>   DW_AT_type        : <0x2d3>
    <a36>   DW_AT_data_member_location: 28
 <2><a37>: Abbrev Number: 19 (DW_TAG_member)
    <a38>   DW_AT_name        : (indirect string, offset: 0x7dc): I2c2ClockSelection
    <a3c>   DW_AT_decl_file   : 11
    <a3d>   DW_AT_decl_line   : 624
    <a3f>   DW_AT_decl_column : 12
    <a40>   DW_AT_type        : <0x2d3>
    <a44>   DW_AT_data_member_location: 32
 <2><a45>: Abbrev Number: 19 (DW_TAG_member)
    <a46>   DW_AT_name        : (indirect string, offset: 0x386a4): I2c3ClockSelection
    <a4a>   DW_AT_decl_file   : 11
    <a4b>   DW_AT_decl_line   : 627
    <a4d>   DW_AT_decl_column : 12
    <a4e>   DW_AT_type        : <0x2d3>
    <a52>   DW_AT_data_member_location: 36
 <2><a53>: Abbrev Number: 19 (DW_TAG_member)
    <a54>   DW_AT_name        : (indirect string, offset: 0xa0c77): Adc12ClockSelection
    <a58>   DW_AT_decl_file   : 11
    <a59>   DW_AT_decl_line   : 630
    <a5b>   DW_AT_decl_column : 12
    <a5c>   DW_AT_type        : <0x2d3>
    <a60>   DW_AT_data_member_location: 40
 <2><a61>: Abbrev Number: 19 (DW_TAG_member)
    <a62>   DW_AT_name        : (indirect string, offset: 0x4de8e): Adc34ClockSelection
    <a66>   DW_AT_decl_file   : 11
    <a67>   DW_AT_decl_line   : 633
    <a69>   DW_AT_decl_column : 12
    <a6a>   DW_AT_type        : <0x2d3>
    <a6e>   DW_AT_data_member_location: 44
 <2><a6f>: Abbrev Number: 19 (DW_TAG_member)
    <a70>   DW_AT_name        : (indirect string, offset: 0xc2e67): I2sClockSelection
    <a74>   DW_AT_decl_file   : 11
    <a75>   DW_AT_decl_line   : 636
    <a77>   DW_AT_decl_column : 12
    <a78>   DW_AT_type        : <0x2d3>
    <a7c>   DW_AT_data_member_location: 48
 <2><a7d>: Abbrev Number: 19 (DW_TAG_member)
    <a7e>   DW_AT_name        : (indirect string, offset: 0x75039): Tim1ClockSelection
    <a82>   DW_AT_decl_file   : 11
    <a83>   DW_AT_decl_line   : 639
    <a85>   DW_AT_decl_column : 12
    <a86>   DW_AT_type        : <0x2d3>
    <a8a>   DW_AT_data_member_location: 52
 <2><a8b>: Abbrev Number: 19 (DW_TAG_member)
    <a8c>   DW_AT_name        : (indirect string, offset: 0xac7b3): Tim2ClockSelection
    <a90>   DW_AT_decl_file   : 11
    <a91>   DW_AT_decl_line   : 642
    <a93>   DW_AT_decl_column : 12
    <a94>   DW_AT_type        : <0x2d3>
    <a98>   DW_AT_data_member_location: 56
 <2><a99>: Abbrev Number: 19 (DW_TAG_member)
    <a9a>   DW_AT_name        : (indirect string, offset: 0x79f82): Tim34ClockSelection
    <a9e>   DW_AT_decl_file   : 11
    <a9f>   DW_AT_decl_line   : 645
    <aa1>   DW_AT_decl_column : 12
    <aa2>   DW_AT_type        : <0x2d3>
    <aa6>   DW_AT_data_member_location: 60
 <2><aa7>: Abbrev Number: 19 (DW_TAG_member)
    <aa8>   DW_AT_name        : (indirect string, offset: 0x474d7): Tim8ClockSelection
    <aac>   DW_AT_decl_file   : 11
    <aad>   DW_AT_decl_line   : 648
    <aaf>   DW_AT_decl_column : 12
    <ab0>   DW_AT_type        : <0x2d3>
    <ab4>   DW_AT_data_member_location: 64
 <2><ab5>: Abbrev Number: 19 (DW_TAG_member)
    <ab6>   DW_AT_name        : (indirect string, offset: 0x965af): Tim15ClockSelection
    <aba>   DW_AT_decl_file   : 11
    <abb>   DW_AT_decl_line   : 651
    <abd>   DW_AT_decl_column : 12
    <abe>   DW_AT_type        : <0x2d3>
    <ac2>   DW_AT_data_member_location: 68
 <2><ac3>: Abbrev Number: 19 (DW_TAG_member)
    <ac4>   DW_AT_name        : (indirect string, offset: 0x2017): Tim16ClockSelection
    <ac8>   DW_AT_decl_file   : 11
    <ac9>   DW_AT_decl_line   : 654
    <acb>   DW_AT_decl_column : 12
    <acc>   DW_AT_type        : <0x2d3>
    <ad0>   DW_AT_data_member_location: 72
 <2><ad1>: Abbrev Number: 19 (DW_TAG_member)
    <ad2>   DW_AT_name        : (indirect string, offset: 0x3055c): Tim17ClockSelection
    <ad6>   DW_AT_decl_file   : 11
    <ad7>   DW_AT_decl_line   : 657
    <ad9>   DW_AT_decl_column : 12
    <ada>   DW_AT_type        : <0x2d3>
    <ade>   DW_AT_data_member_location: 76
 <2><adf>: Abbrev Number: 19 (DW_TAG_member)
    <ae0>   DW_AT_name        : (indirect string, offset: 0x6be16): Tim20ClockSelection
    <ae4>   DW_AT_decl_file   : 11
    <ae5>   DW_AT_decl_line   : 660
    <ae7>   DW_AT_decl_column : 12
    <ae8>   DW_AT_type        : <0x2d3>
    <aec>   DW_AT_data_member_location: 80
 <2><aed>: Abbrev Number: 19 (DW_TAG_member)
    <aee>   DW_AT_name        : (indirect string, offset: 0x64961): USBClockSelection
    <af2>   DW_AT_decl_file   : 11
    <af3>   DW_AT_decl_line   : 663
    <af5>   DW_AT_decl_column : 12
    <af6>   DW_AT_type        : <0x2d3>
    <afa>   DW_AT_data_member_location: 84
 <2><afb>: Abbrev Number: 0
 <1><afc>: Abbrev Number: 20 (DW_TAG_typedef)
    <afd>   DW_AT_name        : (indirect string, offset: 0x7e084): RCC_PeriphCLKInitTypeDef
    <b01>   DW_AT_decl_file   : 11
    <b02>   DW_AT_decl_line   : 666
    <b04>   DW_AT_decl_column : 2
    <b05>   DW_AT_type        : <0x9bd>
 <1><b09>: Abbrev Number: 14 (DW_TAG_structure_type)
    <b0a>   DW_AT_byte_size   : 20
    <b0b>   DW_AT_decl_file   : 12
    <b0c>   DW_AT_decl_line   : 46
    <b0d>   DW_AT_decl_column : 9
    <b0e>   DW_AT_sibling     : <0xb54>
 <2><b12>: Abbrev Number: 15 (DW_TAG_member)
    <b13>   DW_AT_name        : Pin
    <b17>   DW_AT_decl_file   : 12
    <b18>   DW_AT_decl_line   : 48
    <b19>   DW_AT_decl_column : 12
    <b1a>   DW_AT_type        : <0x2d3>
    <b1e>   DW_AT_data_member_location: 0
 <2><b1f>: Abbrev Number: 16 (DW_TAG_member)
    <b20>   DW_AT_name        : (indirect string, offset: 0xce121): Mode
    <b24>   DW_AT_decl_file   : 12
    <b25>   DW_AT_decl_line   : 51
    <b26>   DW_AT_decl_column : 12
    <b27>   DW_AT_type        : <0x2d3>
    <b2b>   DW_AT_data_member_location: 4
 <2><b2c>: Abbrev Number: 16 (DW_TAG_member)
    <b2d>   DW_AT_name        : (indirect string, offset: 0x3b1f): Pull
    <b31>   DW_AT_decl_file   : 12
    <b32>   DW_AT_decl_line   : 54
    <b33>   DW_AT_decl_column : 12
    <b34>   DW_AT_type        : <0x2d3>
    <b38>   DW_AT_data_member_location: 8
 <2><b39>: Abbrev Number: 16 (DW_TAG_member)
    <b3a>   DW_AT_name        : (indirect string, offset: 0x775c8): Speed
    <b3e>   DW_AT_decl_file   : 12
    <b3f>   DW_AT_decl_line   : 57
    <b40>   DW_AT_decl_column : 12
    <b41>   DW_AT_type        : <0x2d3>
    <b45>   DW_AT_data_member_location: 12
 <2><b46>: Abbrev Number: 16 (DW_TAG_member)
    <b47>   DW_AT_name        : (indirect string, offset: 0x5cbf0): Alternate
    <b4b>   DW_AT_decl_file   : 12
    <b4c>   DW_AT_decl_line   : 60
    <b4d>   DW_AT_decl_column : 12
    <b4e>   DW_AT_type        : <0x2d3>
    <b52>   DW_AT_data_member_location: 16
 <2><b53>: Abbrev Number: 0
 <1><b54>: Abbrev Number: 6 (DW_TAG_typedef)
    <b55>   DW_AT_name        : (indirect string, offset: 0xb5d4): GPIO_InitTypeDef
    <b59>   DW_AT_decl_file   : 12
    <b5a>   DW_AT_decl_line   : 62
    <b5b>   DW_AT_decl_column : 2
    <b5c>   DW_AT_type        : <0xb09>
 <1><b60>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <b61>   DW_AT_encoding    : 7	(unsigned)
    <b62>   DW_AT_byte_size   : 1
    <b63>   DW_AT_type        : <0x23d>
    <b67>   DW_AT_decl_file   : 12
    <b68>   DW_AT_decl_line   : 68
    <b69>   DW_AT_decl_column : 1
    <b6a>   DW_AT_sibling     : <0xb7b>
 <2><b6e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b6f>   DW_AT_name        : (indirect string, offset: 0x299fd): GPIO_PIN_RESET
    <b73>   DW_AT_const_value : 0
 <2><b74>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b75>   DW_AT_name        : (indirect string, offset: 0x23d79): GPIO_PIN_SET
    <b79>   DW_AT_const_value : 1
 <2><b7a>: Abbrev Number: 0
 <1><b7b>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <b7c>   DW_AT_prototyped  : 1
 <1><b7c>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <b7d>   DW_AT_byte_size   : 4
    <b7e>   DW_AT_type        : <0xb7b>
 <1><b82>: Abbrev Number: 14 (DW_TAG_structure_type)
    <b83>   DW_AT_byte_size   : 28
    <b84>   DW_AT_decl_file   : 13
    <b85>   DW_AT_decl_line   : 47
    <b86>   DW_AT_decl_column : 9
    <b87>   DW_AT_sibling     : <0xbe7>
 <2><b8b>: Abbrev Number: 16 (DW_TAG_member)
    <b8c>   DW_AT_name        : (indirect string, offset: 0x4bba1): Direction
    <b90>   DW_AT_decl_file   : 13
    <b91>   DW_AT_decl_line   : 49
    <b92>   DW_AT_decl_column : 12
    <b93>   DW_AT_type        : <0x2d3>
    <b97>   DW_AT_data_member_location: 0
 <2><b98>: Abbrev Number: 16 (DW_TAG_member)
    <b99>   DW_AT_name        : (indirect string, offset: 0xccbc): PeriphInc
    <b9d>   DW_AT_decl_file   : 13
    <b9e>   DW_AT_decl_line   : 53
    <b9f>   DW_AT_decl_column : 12
    <ba0>   DW_AT_type        : <0x2d3>
    <ba4>   DW_AT_data_member_location: 4
 <2><ba5>: Abbrev Number: 16 (DW_TAG_member)
    <ba6>   DW_AT_name        : (indirect string, offset: 0x1fa4a): MemInc
    <baa>   DW_AT_decl_file   : 13
    <bab>   DW_AT_decl_line   : 56
    <bac>   DW_AT_decl_column : 12
    <bad>   DW_AT_type        : <0x2d3>
    <bb1>   DW_AT_data_member_location: 8
 <2><bb2>: Abbrev Number: 16 (DW_TAG_member)
    <bb3>   DW_AT_name        : (indirect string, offset: 0x64c3d): PeriphDataAlignment
    <bb7>   DW_AT_decl_file   : 13
    <bb8>   DW_AT_decl_line   : 59
    <bb9>   DW_AT_decl_column : 12
    <bba>   DW_AT_type        : <0x2d3>
    <bbe>   DW_AT_data_member_location: 12
 <2><bbf>: Abbrev Number: 16 (DW_TAG_member)
    <bc0>   DW_AT_name        : (indirect string, offset: 0xb76ff): MemDataAlignment
    <bc4>   DW_AT_decl_file   : 13
    <bc5>   DW_AT_decl_line   : 62
    <bc6>   DW_AT_decl_column : 12
    <bc7>   DW_AT_type        : <0x2d3>
    <bcb>   DW_AT_data_member_location: 16
 <2><bcc>: Abbrev Number: 16 (DW_TAG_member)
    <bcd>   DW_AT_name        : (indirect string, offset: 0xce121): Mode
    <bd1>   DW_AT_decl_file   : 13
    <bd2>   DW_AT_decl_line   : 65
    <bd3>   DW_AT_decl_column : 12
    <bd4>   DW_AT_type        : <0x2d3>
    <bd8>   DW_AT_data_member_location: 20
 <2><bd9>: Abbrev Number: 16 (DW_TAG_member)
    <bda>   DW_AT_name        : (indirect string, offset: 0xce8da): Priority
    <bde>   DW_AT_decl_file   : 13
    <bdf>   DW_AT_decl_line   : 70
    <be0>   DW_AT_decl_column : 12
    <be1>   DW_AT_type        : <0x2d3>
    <be5>   DW_AT_data_member_location: 24
 <2><be6>: Abbrev Number: 0
 <1><be7>: Abbrev Number: 6 (DW_TAG_typedef)
    <be8>   DW_AT_name        : (indirect string, offset: 0x371c6): DMA_InitTypeDef
    <bec>   DW_AT_decl_file   : 13
    <bed>   DW_AT_decl_line   : 72
    <bee>   DW_AT_decl_column : 3
    <bef>   DW_AT_type        : <0xb82>
 <1><bf3>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <bf4>   DW_AT_encoding    : 7	(unsigned)
    <bf5>   DW_AT_byte_size   : 1
    <bf6>   DW_AT_type        : <0x23d>
    <bfa>   DW_AT_decl_file   : 13
    <bfb>   DW_AT_decl_line   : 78
    <bfc>   DW_AT_decl_column : 1
    <bfd>   DW_AT_sibling     : <0xc1a>
 <2><c01>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c02>   DW_AT_name        : (indirect string, offset: 0x97ad1): HAL_DMA_STATE_RESET
    <c06>   DW_AT_const_value : 0
 <2><c07>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c08>   DW_AT_name        : (indirect string, offset: 0x385b3): HAL_DMA_STATE_READY
    <c0c>   DW_AT_const_value : 1
 <2><c0d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c0e>   DW_AT_name        : (indirect string, offset: 0x8d3e4): HAL_DMA_STATE_BUSY
    <c12>   DW_AT_const_value : 2
 <2><c13>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c14>   DW_AT_name        : (indirect string, offset: 0xc78f8): HAL_DMA_STATE_TIMEOUT
    <c18>   DW_AT_const_value : 3
 <2><c19>: Abbrev Number: 0
 <1><c1a>: Abbrev Number: 6 (DW_TAG_typedef)
    <c1b>   DW_AT_name        : (indirect string, offset: 0x70508): HAL_DMA_StateTypeDef
    <c1f>   DW_AT_decl_file   : 13
    <c20>   DW_AT_decl_line   : 83
    <c21>   DW_AT_decl_column : 2
    <c22>   DW_AT_type        : <0xbf3>
 <1><c26>: Abbrev Number: 23 (DW_TAG_structure_type)
    <c27>   DW_AT_name        : (indirect string, offset: 0xad9a5): __DMA_HandleTypeDef
    <c2b>   DW_AT_byte_size   : 68
    <c2c>   DW_AT_decl_file   : 13
    <c2d>   DW_AT_decl_line   : 109
    <c2e>   DW_AT_decl_column : 16
    <c2f>   DW_AT_sibling     : <0xcd0>
 <2><c33>: Abbrev Number: 16 (DW_TAG_member)
    <c34>   DW_AT_name        : (indirect string, offset: 0x4f52d): Instance
    <c38>   DW_AT_decl_file   : 13
    <c39>   DW_AT_decl_line   : 111
    <c3a>   DW_AT_decl_column : 26
    <c3b>   DW_AT_type        : <0xcd0>
    <c3f>   DW_AT_data_member_location: 0
 <2><c40>: Abbrev Number: 16 (DW_TAG_member)
    <c41>   DW_AT_name        : (indirect string, offset: 0x3a4e9): Init
    <c45>   DW_AT_decl_file   : 13
    <c46>   DW_AT_decl_line   : 113
    <c47>   DW_AT_decl_column : 25
    <c48>   DW_AT_type        : <0xbe7>
    <c4c>   DW_AT_data_member_location: 4
 <2><c4d>: Abbrev Number: 16 (DW_TAG_member)
    <c4e>   DW_AT_name        : (indirect string, offset: 0x753ca): Lock
    <c52>   DW_AT_decl_file   : 13
    <c53>   DW_AT_decl_line   : 115
    <c54>   DW_AT_decl_column : 25
    <c55>   DW_AT_type        : <0x88c>
    <c59>   DW_AT_data_member_location: 32
 <2><c5a>: Abbrev Number: 16 (DW_TAG_member)
    <c5b>   DW_AT_name        : (indirect string, offset: 0x8a70b): State
    <c5f>   DW_AT_decl_file   : 13
    <c60>   DW_AT_decl_line   : 117
    <c61>   DW_AT_decl_column : 25
    <c62>   DW_AT_type        : <0xc1a>
    <c66>   DW_AT_data_member_location: 33
 <2><c67>: Abbrev Number: 16 (DW_TAG_member)
    <c68>   DW_AT_name        : (indirect string, offset: 0xc0c37): Parent
    <c6c>   DW_AT_decl_file   : 13
    <c6d>   DW_AT_decl_line   : 119
    <c6e>   DW_AT_decl_column : 26
    <c6f>   DW_AT_type        : <0xcd6>
    <c73>   DW_AT_data_member_location: 36
 <2><c74>: Abbrev Number: 16 (DW_TAG_member)
    <c75>   DW_AT_name        : (indirect string, offset: 0xc9d7d): XferCpltCallback
    <c79>   DW_AT_decl_file   : 13
    <c7a>   DW_AT_decl_line   : 121
    <c7b>   DW_AT_decl_column : 28
    <c7c>   DW_AT_type        : <0xce9>
    <c80>   DW_AT_data_member_location: 40
 <2><c81>: Abbrev Number: 16 (DW_TAG_member)
    <c82>   DW_AT_name        : (indirect string, offset: 0x9e002): XferHalfCpltCallback
    <c86>   DW_AT_decl_file   : 13
    <c87>   DW_AT_decl_line   : 123
    <c88>   DW_AT_decl_column : 28
    <c89>   DW_AT_type        : <0xce9>
    <c8d>   DW_AT_data_member_location: 44
 <2><c8e>: Abbrev Number: 16 (DW_TAG_member)
    <c8f>   DW_AT_name        : (indirect string, offset: 0x1ce03): XferErrorCallback
    <c93>   DW_AT_decl_file   : 13
    <c94>   DW_AT_decl_line   : 125
    <c95>   DW_AT_decl_column : 28
    <c96>   DW_AT_type        : <0xce9>
    <c9a>   DW_AT_data_member_location: 48
 <2><c9b>: Abbrev Number: 16 (DW_TAG_member)
    <c9c>   DW_AT_name        : (indirect string, offset: 0x6ddee): XferAbortCallback
    <ca0>   DW_AT_decl_file   : 13
    <ca1>   DW_AT_decl_line   : 127
    <ca2>   DW_AT_decl_column : 28
    <ca3>   DW_AT_type        : <0xce9>
    <ca7>   DW_AT_data_member_location: 52
 <2><ca8>: Abbrev Number: 16 (DW_TAG_member)
    <ca9>   DW_AT_name        : (indirect string, offset: 0xc62b1): ErrorCode
    <cad>   DW_AT_decl_file   : 13
    <cae>   DW_AT_decl_line   : 129
    <caf>   DW_AT_decl_column : 25
    <cb0>   DW_AT_type        : <0x2df>
    <cb4>   DW_AT_data_member_location: 56
 <2><cb5>: Abbrev Number: 16 (DW_TAG_member)
    <cb6>   DW_AT_name        : (indirect string, offset: 0x5696c): DmaBaseAddress
    <cba>   DW_AT_decl_file   : 13
    <cbb>   DW_AT_decl_line   : 131
    <cbc>   DW_AT_decl_column : 25
    <cbd>   DW_AT_type        : <0xcef>
    <cc1>   DW_AT_data_member_location: 60
 <2><cc2>: Abbrev Number: 16 (DW_TAG_member)
    <cc3>   DW_AT_name        : (indirect string, offset: 0x29b63): ChannelIndex
    <cc7>   DW_AT_decl_file   : 13
    <cc8>   DW_AT_decl_line   : 133
    <cc9>   DW_AT_decl_column : 25
    <cca>   DW_AT_type        : <0x2d3>
    <cce>   DW_AT_data_member_location: 64
 <2><ccf>: Abbrev Number: 0
 <1><cd0>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <cd1>   DW_AT_byte_size   : 4
    <cd2>   DW_AT_type        : <0x587>
 <1><cd6>: Abbrev Number: 24 (DW_TAG_pointer_type)
    <cd7>   DW_AT_byte_size   : 4
 <1><cd8>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <cd9>   DW_AT_prototyped  : 1
    <cd9>   DW_AT_sibling     : <0xce3>
 <2><cdd>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <cde>   DW_AT_type        : <0xce3>
 <2><ce2>: Abbrev Number: 0
 <1><ce3>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <ce4>   DW_AT_byte_size   : 4
    <ce5>   DW_AT_type        : <0xc26>
 <1><ce9>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <cea>   DW_AT_byte_size   : 4
    <ceb>   DW_AT_type        : <0xcd8>
 <1><cef>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <cf0>   DW_AT_byte_size   : 4
    <cf1>   DW_AT_type        : <0x5bb>
 <1><cf5>: Abbrev Number: 6 (DW_TAG_typedef)
    <cf6>   DW_AT_name        : (indirect string, offset: 0xad9a7): DMA_HandleTypeDef
    <cfa>   DW_AT_decl_file   : 13
    <cfb>   DW_AT_decl_line   : 134
    <cfc>   DW_AT_decl_column : 3
    <cfd>   DW_AT_type        : <0xc26>
 <1><d01>: Abbrev Number: 14 (DW_TAG_structure_type)
    <d02>   DW_AT_byte_size   : 52
    <d03>   DW_AT_decl_file   : 14
    <d04>   DW_AT_decl_line   : 62
    <d05>   DW_AT_decl_column : 9
    <d06>   DW_AT_sibling     : <0xdc1>
 <2><d0a>: Abbrev Number: 16 (DW_TAG_member)
    <d0b>   DW_AT_name        : (indirect string, offset: 0xb3268): ClockPrescaler
    <d0f>   DW_AT_decl_file   : 14
    <d10>   DW_AT_decl_line   : 64
    <d11>   DW_AT_decl_column : 12
    <d12>   DW_AT_type        : <0x2d3>
    <d16>   DW_AT_data_member_location: 0
 <2><d17>: Abbrev Number: 16 (DW_TAG_member)
    <d18>   DW_AT_name        : (indirect string, offset: 0xf997): Resolution
    <d1c>   DW_AT_decl_file   : 14
    <d1d>   DW_AT_decl_line   : 71
    <d1e>   DW_AT_decl_column : 12
    <d1f>   DW_AT_type        : <0x2d3>
    <d23>   DW_AT_data_member_location: 4
 <2><d24>: Abbrev Number: 16 (DW_TAG_member)
    <d25>   DW_AT_name        : (indirect string, offset: 0x2bb37): DataAlign
    <d29>   DW_AT_decl_file   : 14
    <d2a>   DW_AT_decl_line   : 73
    <d2b>   DW_AT_decl_column : 12
    <d2c>   DW_AT_type        : <0x2d3>
    <d30>   DW_AT_data_member_location: 8
 <2><d31>: Abbrev Number: 16 (DW_TAG_member)
    <d32>   DW_AT_name        : (indirect string, offset: 0x7a712): ScanConvMode
    <d36>   DW_AT_decl_file   : 14
    <d37>   DW_AT_decl_line   : 77
    <d38>   DW_AT_decl_column : 12
    <d39>   DW_AT_type        : <0x2d3>
    <d3d>   DW_AT_data_member_location: 12
 <2><d3e>: Abbrev Number: 16 (DW_TAG_member)
    <d3f>   DW_AT_name        : (indirect string, offset: 0x5281a): EOCSelection
    <d43>   DW_AT_decl_file   : 14
    <d44>   DW_AT_decl_line   : 84
    <d45>   DW_AT_decl_column : 12
    <d46>   DW_AT_type        : <0x2d3>
    <d4a>   DW_AT_data_member_location: 16
 <2><d4b>: Abbrev Number: 16 (DW_TAG_member)
    <d4c>   DW_AT_name        : (indirect string, offset: 0xaf70d): LowPowerAutoWait
    <d50>   DW_AT_decl_file   : 14
    <d51>   DW_AT_decl_line   : 86
    <d52>   DW_AT_decl_column : 19
    <d53>   DW_AT_type        : <0x837>
    <d57>   DW_AT_data_member_location: 20
 <2><d58>: Abbrev Number: 16 (DW_TAG_member)
    <d59>   DW_AT_name        : (indirect string, offset: 0x553ab): ContinuousConvMode
    <d5d>   DW_AT_decl_file   : 14
    <d5e>   DW_AT_decl_line   : 94
    <d5f>   DW_AT_decl_column : 20
    <d60>   DW_AT_type        : <0x837>
    <d64>   DW_AT_data_member_location: 21
 <2><d65>: Abbrev Number: 16 (DW_TAG_member)
    <d66>   DW_AT_name        : (indirect string, offset: 0xce1a4): NbrOfConversion
    <d6a>   DW_AT_decl_file   : 14
    <d6b>   DW_AT_decl_line   : 97
    <d6c>   DW_AT_decl_column : 12
    <d6d>   DW_AT_type        : <0x2d3>
    <d71>   DW_AT_data_member_location: 24
 <2><d72>: Abbrev Number: 16 (DW_TAG_member)
    <d73>   DW_AT_name        : (indirect string, offset: 0xce381): DiscontinuousConvMode
    <d77>   DW_AT_decl_file   : 14
    <d78>   DW_AT_decl_line   : 101
    <d79>   DW_AT_decl_column : 19
    <d7a>   DW_AT_type        : <0x837>
    <d7e>   DW_AT_data_member_location: 28
 <2><d7f>: Abbrev Number: 16 (DW_TAG_member)
    <d80>   DW_AT_name        : (indirect string, offset: 0x1cbab): NbrOfDiscConversion
    <d84>   DW_AT_decl_file   : 14
    <d85>   DW_AT_decl_line   : 105
    <d86>   DW_AT_decl_column : 12
    <d87>   DW_AT_type        : <0x2d3>
    <d8b>   DW_AT_data_member_location: 32
 <2><d8c>: Abbrev Number: 16 (DW_TAG_member)
    <d8d>   DW_AT_name        : (indirect string, offset: 0x975d4): ExternalTrigConv
    <d91>   DW_AT_decl_file   : 14
    <d92>   DW_AT_decl_line   : 108
    <d93>   DW_AT_decl_column : 12
    <d94>   DW_AT_type        : <0x2d3>
    <d98>   DW_AT_data_member_location: 36
 <2><d99>: Abbrev Number: 16 (DW_TAG_member)
    <d9a>   DW_AT_name        : (indirect string, offset: 0x37fd6): ExternalTrigConvEdge
    <d9e>   DW_AT_decl_file   : 14
    <d9f>   DW_AT_decl_line   : 112
    <da0>   DW_AT_decl_column : 12
    <da1>   DW_AT_type        : <0x2d3>
    <da5>   DW_AT_data_member_location: 40
 <2><da6>: Abbrev Number: 16 (DW_TAG_member)
    <da7>   DW_AT_name        : (indirect string, offset: 0xa02c): DMAContinuousRequests
    <dab>   DW_AT_decl_file   : 14
    <dac>   DW_AT_decl_line   : 115
    <dad>   DW_AT_decl_column : 19
    <dae>   DW_AT_type        : <0x837>
    <db2>   DW_AT_data_member_location: 44
 <2><db3>: Abbrev Number: 16 (DW_TAG_member)
    <db4>   DW_AT_name        : (indirect string, offset: 0x66466): Overrun
    <db8>   DW_AT_decl_file   : 14
    <db9>   DW_AT_decl_line   : 120
    <dba>   DW_AT_decl_column : 12
    <dbb>   DW_AT_type        : <0x2d3>
    <dbf>   DW_AT_data_member_location: 48
 <2><dc0>: Abbrev Number: 0
 <1><dc1>: Abbrev Number: 6 (DW_TAG_typedef)
    <dc2>   DW_AT_name        : (indirect string, offset: 0x294a4): ADC_InitTypeDef
    <dc6>   DW_AT_decl_file   : 14
    <dc7>   DW_AT_decl_line   : 127
    <dc8>   DW_AT_decl_column : 2
    <dc9>   DW_AT_type        : <0xd01>
 <1><dcd>: Abbrev Number: 14 (DW_TAG_structure_type)
    <dce>   DW_AT_byte_size   : 24
    <dcf>   DW_AT_decl_file   : 14
    <dd0>   DW_AT_decl_line   : 139
    <dd1>   DW_AT_decl_column : 9
    <dd2>   DW_AT_sibling     : <0xe25>
 <2><dd6>: Abbrev Number: 16 (DW_TAG_member)
    <dd7>   DW_AT_name        : (indirect string, offset: 0xce097): Channel
    <ddb>   DW_AT_decl_file   : 14
    <ddc>   DW_AT_decl_line   : 141
    <ddd>   DW_AT_decl_column : 12
    <dde>   DW_AT_type        : <0x2d3>
    <de2>   DW_AT_data_member_location: 0
 <2><de3>: Abbrev Number: 16 (DW_TAG_member)
    <de4>   DW_AT_name        : (indirect string, offset: 0xce1bc): Rank
    <de8>   DW_AT_decl_file   : 14
    <de9>   DW_AT_decl_line   : 144
    <dea>   DW_AT_decl_column : 12
    <deb>   DW_AT_type        : <0x2d3>
    <def>   DW_AT_data_member_location: 4
 <2><df0>: Abbrev Number: 16 (DW_TAG_member)
    <df1>   DW_AT_name        : (indirect string, offset: 0xce31a): SamplingTime
    <df5>   DW_AT_decl_file   : 14
    <df6>   DW_AT_decl_line   : 147
    <df7>   DW_AT_decl_column : 12
    <df8>   DW_AT_type        : <0x2d3>
    <dfc>   DW_AT_data_member_location: 8
 <2><dfd>: Abbrev Number: 16 (DW_TAG_member)
    <dfe>   DW_AT_name        : (indirect string, offset: 0xce505): SingleDiff
    <e02>   DW_AT_decl_file   : 14
    <e03>   DW_AT_decl_line   : 156
    <e04>   DW_AT_decl_column : 12
    <e05>   DW_AT_type        : <0x2d3>
    <e09>   DW_AT_data_member_location: 12
 <2><e0a>: Abbrev Number: 16 (DW_TAG_member)
    <e0b>   DW_AT_name        : (indirect string, offset: 0xce492): OffsetNumber
    <e0f>   DW_AT_decl_file   : 14
    <e10>   DW_AT_decl_line   : 166
    <e11>   DW_AT_decl_column : 12
    <e12>   DW_AT_type        : <0x2d3>
    <e16>   DW_AT_data_member_location: 16
 <2><e17>: Abbrev Number: 16 (DW_TAG_member)
    <e18>   DW_AT_name        : (indirect string, offset: 0xce0ee): Offset
    <e1c>   DW_AT_decl_file   : 14
    <e1d>   DW_AT_decl_line   : 169
    <e1e>   DW_AT_decl_column : 12
    <e1f>   DW_AT_type        : <0x2d3>
    <e23>   DW_AT_data_member_location: 20
 <2><e24>: Abbrev Number: 0
 <1><e25>: Abbrev Number: 6 (DW_TAG_typedef)
    <e26>   DW_AT_name        : (indirect string, offset: 0xca0e7): ADC_ChannelConfTypeDef
    <e2a>   DW_AT_decl_file   : 14
    <e2b>   DW_AT_decl_line   : 173
    <e2c>   DW_AT_decl_column : 2
    <e2d>   DW_AT_type        : <0xdcd>
 <1><e31>: Abbrev Number: 17 (DW_TAG_structure_type)
    <e32>   DW_AT_byte_size   : 8
    <e33>   DW_AT_decl_file   : 14
    <e34>   DW_AT_decl_line   : 269
    <e36>   DW_AT_decl_column : 9
    <e37>   DW_AT_sibling     : <0xe58>
 <2><e3b>: Abbrev Number: 19 (DW_TAG_member)
    <e3c>   DW_AT_name        : (indirect string, offset: 0x4c603): ContextQueue
    <e40>   DW_AT_decl_file   : 14
    <e41>   DW_AT_decl_line   : 271
    <e43>   DW_AT_decl_column : 12
    <e44>   DW_AT_type        : <0x2d3>
    <e48>   DW_AT_data_member_location: 0
 <2><e49>: Abbrev Number: 19 (DW_TAG_member)
    <e4a>   DW_AT_name        : (indirect string, offset: 0xa688c): ChannelCount
    <e4e>   DW_AT_decl_file   : 14
    <e4f>   DW_AT_decl_line   : 275
    <e51>   DW_AT_decl_column : 12
    <e52>   DW_AT_type        : <0x2d3>
    <e56>   DW_AT_data_member_location: 4
 <2><e57>: Abbrev Number: 0
 <1><e58>: Abbrev Number: 20 (DW_TAG_typedef)
    <e59>   DW_AT_name        : (indirect string, offset: 0x77267): ADC_InjectionConfigTypeDef
    <e5d>   DW_AT_decl_file   : 14
    <e5e>   DW_AT_decl_line   : 276
    <e60>   DW_AT_decl_column : 2
    <e61>   DW_AT_type        : <0xe31>
 <1><e65>: Abbrev Number: 17 (DW_TAG_structure_type)
    <e66>   DW_AT_byte_size   : 12
    <e67>   DW_AT_decl_file   : 14
    <e68>   DW_AT_decl_line   : 318
    <e6a>   DW_AT_decl_column : 9
    <e6b>   DW_AT_sibling     : <0xe9a>
 <2><e6f>: Abbrev Number: 19 (DW_TAG_member)
    <e70>   DW_AT_name        : (indirect string, offset: 0xce121): Mode
    <e74>   DW_AT_decl_file   : 14
    <e75>   DW_AT_decl_line   : 320
    <e77>   DW_AT_decl_column : 12
    <e78>   DW_AT_type        : <0x2d3>
    <e7c>   DW_AT_data_member_location: 0
 <2><e7d>: Abbrev Number: 19 (DW_TAG_member)
    <e7e>   DW_AT_name        : (indirect string, offset: 0x471fd): DMAAccessMode
    <e82>   DW_AT_decl_file   : 14
    <e83>   DW_AT_decl_line   : 322
    <e85>   DW_AT_decl_column : 12
    <e86>   DW_AT_type        : <0x2d3>
    <e8a>   DW_AT_data_member_location: 4
 <2><e8b>: Abbrev Number: 19 (DW_TAG_member)
    <e8c>   DW_AT_name        : (indirect string, offset: 0x2a1d0): TwoSamplingDelay
    <e90>   DW_AT_decl_file   : 14
    <e91>   DW_AT_decl_line   : 328
    <e93>   DW_AT_decl_column : 12
    <e94>   DW_AT_type        : <0x2d3>
    <e98>   DW_AT_data_member_location: 8
 <2><e99>: Abbrev Number: 0
 <1><e9a>: Abbrev Number: 20 (DW_TAG_typedef)
    <e9b>   DW_AT_name        : (indirect string, offset: 0x62ad1): ADC_MultiModeTypeDef
    <e9f>   DW_AT_decl_file   : 14
    <ea0>   DW_AT_decl_line   : 332
    <ea2>   DW_AT_decl_column : 2
    <ea3>   DW_AT_type        : <0xe65>
 <1><ea7>: Abbrev Number: 23 (DW_TAG_structure_type)
    <ea8>   DW_AT_name        : (indirect string, offset: 0xc5172): __ADC_HandleTypeDef
    <eac>   DW_AT_byte_size   : 80
    <ead>   DW_AT_decl_file   : 15
    <eae>   DW_AT_decl_line   : 90
    <eaf>   DW_AT_decl_column : 16
    <eb0>   DW_AT_sibling     : <0xf10>
 <2><eb4>: Abbrev Number: 16 (DW_TAG_member)
    <eb5>   DW_AT_name        : (indirect string, offset: 0x4f52d): Instance
    <eb9>   DW_AT_decl_file   : 15
    <eba>   DW_AT_decl_line   : 92
    <ebb>   DW_AT_decl_column : 34
    <ebc>   DW_AT_type        : <0xf10>
    <ec0>   DW_AT_data_member_location: 0
 <2><ec1>: Abbrev Number: 16 (DW_TAG_member)
    <ec2>   DW_AT_name        : (indirect string, offset: 0x3a4e9): Init
    <ec6>   DW_AT_decl_file   : 15
    <ec7>   DW_AT_decl_line   : 94
    <ec8>   DW_AT_decl_column : 33
    <ec9>   DW_AT_type        : <0xdc1>
    <ecd>   DW_AT_data_member_location: 4
 <2><ece>: Abbrev Number: 16 (DW_TAG_member)
    <ecf>   DW_AT_name        : (indirect string, offset: 0x1d31): DMA_Handle
    <ed3>   DW_AT_decl_file   : 15
    <ed4>   DW_AT_decl_line   : 96
    <ed5>   DW_AT_decl_column : 34
    <ed6>   DW_AT_type        : <0xf16>
    <eda>   DW_AT_data_member_location: 56
 <2><edb>: Abbrev Number: 16 (DW_TAG_member)
    <edc>   DW_AT_name        : (indirect string, offset: 0x753ca): Lock
    <ee0>   DW_AT_decl_file   : 15
    <ee1>   DW_AT_decl_line   : 98
    <ee2>   DW_AT_decl_column : 33
    <ee3>   DW_AT_type        : <0x88c>
    <ee7>   DW_AT_data_member_location: 60
 <2><ee8>: Abbrev Number: 16 (DW_TAG_member)
    <ee9>   DW_AT_name        : (indirect string, offset: 0x8a70b): State
    <eed>   DW_AT_decl_file   : 15
    <eee>   DW_AT_decl_line   : 100
    <eef>   DW_AT_decl_column : 33
    <ef0>   DW_AT_type        : <0x2df>
    <ef4>   DW_AT_data_member_location: 64
 <2><ef5>: Abbrev Number: 16 (DW_TAG_member)
    <ef6>   DW_AT_name        : (indirect string, offset: 0xc62b1): ErrorCode
    <efa>   DW_AT_decl_file   : 15
    <efb>   DW_AT_decl_line   : 102
    <efc>   DW_AT_decl_column : 33
    <efd>   DW_AT_type        : <0x2df>
    <f01>   DW_AT_data_member_location: 68
 <2><f02>: Abbrev Number: 16 (DW_TAG_member)
    <f03>   DW_AT_name        : (indirect string, offset: 0x26d38): InjectionConfig
    <f07>   DW_AT_decl_file   : 15
    <f08>   DW_AT_decl_line   : 108
    <f09>   DW_AT_decl_column : 33
    <f0a>   DW_AT_type        : <0xe58>
    <f0e>   DW_AT_data_member_location: 72
 <2><f0f>: Abbrev Number: 0
 <1><f10>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <f11>   DW_AT_byte_size   : 4
    <f12>   DW_AT_type        : <0x538>
 <1><f16>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <f17>   DW_AT_byte_size   : 4
    <f18>   DW_AT_type        : <0xcf5>
 <1><f1c>: Abbrev Number: 6 (DW_TAG_typedef)
    <f1d>   DW_AT_name        : (indirect string, offset: 0xc5174): ADC_HandleTypeDef
    <f21>   DW_AT_decl_file   : 15
    <f22>   DW_AT_decl_line   : 123
    <f23>   DW_AT_decl_column : 2
    <f24>   DW_AT_type        : <0xea7>
 <1><f28>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <f29>   DW_AT_byte_size   : 4
    <f2a>   DW_AT_type        : <0x2a0>
 <1><f2e>: Abbrev Number: 14 (DW_TAG_structure_type)
    <f2f>   DW_AT_byte_size   : 32
    <f30>   DW_AT_decl_file   : 16
    <f31>   DW_AT_decl_line   : 46
    <f32>   DW_AT_decl_column : 9
    <f33>   DW_AT_sibling     : <0xfa0>
 <2><f37>: Abbrev Number: 16 (DW_TAG_member)
    <f38>   DW_AT_name        : (indirect string, offset: 0xb9f33): BaudRate
    <f3c>   DW_AT_decl_file   : 16
    <f3d>   DW_AT_decl_line   : 48
    <f3e>   DW_AT_decl_column : 12
    <f3f>   DW_AT_type        : <0x2d3>
    <f43>   DW_AT_data_member_location: 0
 <2><f44>: Abbrev Number: 16 (DW_TAG_member)
    <f45>   DW_AT_name        : (indirect string, offset: 0x57d4): WordLength
    <f49>   DW_AT_decl_file   : 16
    <f4a>   DW_AT_decl_line   : 60
    <f4b>   DW_AT_decl_column : 12
    <f4c>   DW_AT_type        : <0x2d3>
    <f50>   DW_AT_data_member_location: 4
 <2><f51>: Abbrev Number: 16 (DW_TAG_member)
    <f52>   DW_AT_name        : (indirect string, offset: 0xba2cb): StopBits
    <f56>   DW_AT_decl_file   : 16
    <f57>   DW_AT_decl_line   : 63
    <f58>   DW_AT_decl_column : 12
    <f59>   DW_AT_type        : <0x2d3>
    <f5d>   DW_AT_data_member_location: 8
 <2><f5e>: Abbrev Number: 16 (DW_TAG_member)
    <f5f>   DW_AT_name        : (indirect string, offset: 0x49ba9): Parity
    <f63>   DW_AT_decl_file   : 16
    <f64>   DW_AT_decl_line   : 66
    <f65>   DW_AT_decl_column : 12
    <f66>   DW_AT_type        : <0x2d3>
    <f6a>   DW_AT_data_member_location: 12
 <2><f6b>: Abbrev Number: 16 (DW_TAG_member)
    <f6c>   DW_AT_name        : (indirect string, offset: 0xce121): Mode
    <f70>   DW_AT_decl_file   : 16
    <f71>   DW_AT_decl_line   : 73
    <f72>   DW_AT_decl_column : 12
    <f73>   DW_AT_type        : <0x2d3>
    <f77>   DW_AT_data_member_location: 16
 <2><f78>: Abbrev Number: 16 (DW_TAG_member)
    <f79>   DW_AT_name        : (indirect string, offset: 0x78717): HwFlowCtl
    <f7d>   DW_AT_decl_file   : 16
    <f7e>   DW_AT_decl_line   : 76
    <f7f>   DW_AT_decl_column : 12
    <f80>   DW_AT_type        : <0x2d3>
    <f84>   DW_AT_data_member_location: 20
 <2><f85>: Abbrev Number: 16 (DW_TAG_member)
    <f86>   DW_AT_name        : (indirect string, offset: 0xab254): OverSampling
    <f8a>   DW_AT_decl_file   : 16
    <f8b>   DW_AT_decl_line   : 80
    <f8c>   DW_AT_decl_column : 12
    <f8d>   DW_AT_type        : <0x2d3>
    <f91>   DW_AT_data_member_location: 24
 <2><f92>: Abbrev Number: 16 (DW_TAG_member)
    <f93>   DW_AT_name        : (indirect string, offset: 0x28e04): OneBitSampling
    <f97>   DW_AT_decl_file   : 16
    <f98>   DW_AT_decl_line   : 84
    <f99>   DW_AT_decl_column : 12
    <f9a>   DW_AT_type        : <0x2d3>
    <f9e>   DW_AT_data_member_location: 28
 <2><f9f>: Abbrev Number: 0
 <1><fa0>: Abbrev Number: 6 (DW_TAG_typedef)
    <fa1>   DW_AT_name        : (indirect string, offset: 0x39ae3): UART_InitTypeDef
    <fa5>   DW_AT_decl_file   : 16
    <fa6>   DW_AT_decl_line   : 89
    <fa7>   DW_AT_decl_column : 3
    <fa8>   DW_AT_type        : <0xf2e>
 <1><fac>: Abbrev Number: 14 (DW_TAG_structure_type)
    <fad>   DW_AT_byte_size   : 40
    <fae>   DW_AT_decl_file   : 16
    <faf>   DW_AT_decl_line   : 94
    <fb0>   DW_AT_decl_column : 9
    <fb1>   DW_AT_sibling     : <0x1038>
 <2><fb5>: Abbrev Number: 16 (DW_TAG_member)
    <fb6>   DW_AT_name        : (indirect string, offset: 0x7d081): AdvFeatureInit
    <fba>   DW_AT_decl_file   : 16
    <fbb>   DW_AT_decl_line   : 96
    <fbc>   DW_AT_decl_column : 12
    <fbd>   DW_AT_type        : <0x2d3>
    <fc1>   DW_AT_data_member_location: 0
 <2><fc2>: Abbrev Number: 16 (DW_TAG_member)
    <fc3>   DW_AT_name        : (indirect string, offset: 0xbd10a): TxPinLevelInvert
    <fc7>   DW_AT_decl_file   : 16
    <fc8>   DW_AT_decl_line   : 101
    <fc9>   DW_AT_decl_column : 12
    <fca>   DW_AT_type        : <0x2d3>
    <fce>   DW_AT_data_member_location: 4
 <2><fcf>: Abbrev Number: 16 (DW_TAG_member)
    <fd0>   DW_AT_name        : (indirect string, offset: 0xab6b1): RxPinLevelInvert
    <fd4>   DW_AT_decl_file   : 16
    <fd5>   DW_AT_decl_line   : 104
    <fd6>   DW_AT_decl_column : 12
    <fd7>   DW_AT_type        : <0x2d3>
    <fdb>   DW_AT_data_member_location: 8
 <2><fdc>: Abbrev Number: 16 (DW_TAG_member)
    <fdd>   DW_AT_name        : (indirect string, offset: 0x88f27): DataInvert
    <fe1>   DW_AT_decl_file   : 16
    <fe2>   DW_AT_decl_line   : 107
    <fe3>   DW_AT_decl_column : 12
    <fe4>   DW_AT_type        : <0x2d3>
    <fe8>   DW_AT_data_member_location: 12
 <2><fe9>: Abbrev Number: 16 (DW_TAG_member)
    <fea>   DW_AT_name        : (indirect string, offset: 0x40e99): Swap
    <fee>   DW_AT_decl_file   : 16
    <fef>   DW_AT_decl_line   : 111
    <ff0>   DW_AT_decl_column : 12
    <ff1>   DW_AT_type        : <0x2d3>
    <ff5>   DW_AT_data_member_location: 16
 <2><ff6>: Abbrev Number: 16 (DW_TAG_member)
    <ff7>   DW_AT_name        : (indirect string, offset: 0x7c61): OverrunDisable
    <ffb>   DW_AT_decl_file   : 16
    <ffc>   DW_AT_decl_line   : 114
    <ffd>   DW_AT_decl_column : 12
    <ffe>   DW_AT_type        : <0x2d3>
    <1002>   DW_AT_data_member_location: 20
 <2><1003>: Abbrev Number: 16 (DW_TAG_member)
    <1004>   DW_AT_name        : (indirect string, offset: 0x41fd6): DMADisableonRxError
    <1008>   DW_AT_decl_file   : 16
    <1009>   DW_AT_decl_line   : 117
    <100a>   DW_AT_decl_column : 12
    <100b>   DW_AT_type        : <0x2d3>
    <100f>   DW_AT_data_member_location: 24
 <2><1010>: Abbrev Number: 16 (DW_TAG_member)
    <1011>   DW_AT_name        : (indirect string, offset: 0xc5c60): AutoBaudRateEnable
    <1015>   DW_AT_decl_file   : 16
    <1016>   DW_AT_decl_line   : 120
    <1017>   DW_AT_decl_column : 12
    <1018>   DW_AT_type        : <0x2d3>
    <101c>   DW_AT_data_member_location: 28
 <2><101d>: Abbrev Number: 16 (DW_TAG_member)
    <101e>   DW_AT_name        : (indirect string, offset: 0xad1df): AutoBaudRateMode
    <1022>   DW_AT_decl_file   : 16
    <1023>   DW_AT_decl_line   : 123
    <1024>   DW_AT_decl_column : 12
    <1025>   DW_AT_type        : <0x2d3>
    <1029>   DW_AT_data_member_location: 32
 <2><102a>: Abbrev Number: 16 (DW_TAG_member)
    <102b>   DW_AT_name        : (indirect string, offset: 0x59b08): MSBFirst
    <102f>   DW_AT_decl_file   : 16
    <1030>   DW_AT_decl_line   : 127
    <1031>   DW_AT_decl_column : 12
    <1032>   DW_AT_type        : <0x2d3>
    <1036>   DW_AT_data_member_location: 36
 <2><1037>: Abbrev Number: 0
 <1><1038>: Abbrev Number: 6 (DW_TAG_typedef)
    <1039>   DW_AT_name        : (indirect string, offset: 0x97758): UART_AdvFeatureInitTypeDef
    <103d>   DW_AT_decl_file   : 16
    <103e>   DW_AT_decl_line   : 129
    <103f>   DW_AT_decl_column : 3
    <1040>   DW_AT_type        : <0xfac>
 <1><1044>: Abbrev Number: 6 (DW_TAG_typedef)
    <1045>   DW_AT_name        : (indirect string, offset: 0x3e73b): HAL_UART_StateTypeDef
    <1049>   DW_AT_decl_file   : 16
    <104a>   DW_AT_decl_line   : 171
    <104b>   DW_AT_decl_column : 18
    <104c>   DW_AT_type        : <0x2d3>
 <1><1050>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <1051>   DW_AT_type        : <0x1044>
 <1><1055>: Abbrev Number: 6 (DW_TAG_typedef)
    <1056>   DW_AT_name        : (indirect string, offset: 0x5334d): HAL_UART_RxTypeTypeDef
    <105a>   DW_AT_decl_file   : 16
    <105b>   DW_AT_decl_line   : 195
    <105c>   DW_AT_decl_column : 18
    <105d>   DW_AT_type        : <0x2d3>
 <1><1061>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <1062>   DW_AT_type        : <0x1055>
 <1><1066>: Abbrev Number: 6 (DW_TAG_typedef)
    <1067>   DW_AT_name        : (indirect string, offset: 0x18a21): HAL_UART_RxEventTypeTypeDef
    <106b>   DW_AT_decl_file   : 16
    <106c>   DW_AT_decl_line   : 206
    <106d>   DW_AT_decl_column : 18
    <106e>   DW_AT_type        : <0x2d3>
 <1><1072>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <1073>   DW_AT_type        : <0x1066>
 <1><1077>: Abbrev Number: 23 (DW_TAG_structure_type)
    <1078>   DW_AT_name        : (indirect string, offset: 0x7642e): __UART_HandleTypeDef
    <107c>   DW_AT_byte_size   : 136
    <107d>   DW_AT_decl_file   : 16
    <107e>   DW_AT_decl_line   : 211
    <107f>   DW_AT_decl_column : 16
    <1080>   DW_AT_sibling     : <0x1189>
 <2><1084>: Abbrev Number: 16 (DW_TAG_member)
    <1085>   DW_AT_name        : (indirect string, offset: 0x4f52d): Instance
    <1089>   DW_AT_decl_file   : 16
    <108a>   DW_AT_decl_line   : 213
    <108b>   DW_AT_decl_column : 29
    <108c>   DW_AT_type        : <0x1189>
    <1090>   DW_AT_data_member_location: 0
 <2><1091>: Abbrev Number: 16 (DW_TAG_member)
    <1092>   DW_AT_name        : (indirect string, offset: 0x3a4e9): Init
    <1096>   DW_AT_decl_file   : 16
    <1097>   DW_AT_decl_line   : 215
    <1098>   DW_AT_decl_column : 28
    <1099>   DW_AT_type        : <0xfa0>
    <109d>   DW_AT_data_member_location: 4
 <2><109e>: Abbrev Number: 16 (DW_TAG_member)
    <109f>   DW_AT_name        : (indirect string, offset: 0x9eddd): AdvancedInit
    <10a3>   DW_AT_decl_file   : 16
    <10a4>   DW_AT_decl_line   : 217
    <10a5>   DW_AT_decl_column : 30
    <10a6>   DW_AT_type        : <0x1038>
    <10aa>   DW_AT_data_member_location: 36
 <2><10ab>: Abbrev Number: 16 (DW_TAG_member)
    <10ac>   DW_AT_name        : (indirect string, offset: 0x611b4): pTxBuffPtr
    <10b0>   DW_AT_decl_file   : 16
    <10b1>   DW_AT_decl_line   : 219
    <10b2>   DW_AT_decl_column : 29
    <10b3>   DW_AT_type        : <0x118f>
    <10b7>   DW_AT_data_member_location: 76
 <2><10b8>: Abbrev Number: 16 (DW_TAG_member)
    <10b9>   DW_AT_name        : (indirect string, offset: 0x559f7): TxXferSize
    <10bd>   DW_AT_decl_file   : 16
    <10be>   DW_AT_decl_line   : 221
    <10bf>   DW_AT_decl_column : 28
    <10c0>   DW_AT_type        : <0x2b1>
    <10c4>   DW_AT_data_member_location: 80
 <2><10c5>: Abbrev Number: 16 (DW_TAG_member)
    <10c6>   DW_AT_name        : (indirect string, offset: 0x6f7a9): TxXferCount
    <10ca>   DW_AT_decl_file   : 16
    <10cb>   DW_AT_decl_line   : 223
    <10cc>   DW_AT_decl_column : 28
    <10cd>   DW_AT_type        : <0x2bd>
    <10d1>   DW_AT_data_member_location: 82
 <2><10d2>: Abbrev Number: 16 (DW_TAG_member)
    <10d3>   DW_AT_name        : (indirect string, offset: 0xbc911): pRxBuffPtr
    <10d7>   DW_AT_decl_file   : 16
    <10d8>   DW_AT_decl_line   : 225
    <10d9>   DW_AT_decl_column : 29
    <10da>   DW_AT_type        : <0xf28>
    <10de>   DW_AT_data_member_location: 84
 <2><10df>: Abbrev Number: 16 (DW_TAG_member)
    <10e0>   DW_AT_name        : (indirect string, offset: 0x608a9): RxXferSize
    <10e4>   DW_AT_decl_file   : 16
    <10e5>   DW_AT_decl_line   : 227
    <10e6>   DW_AT_decl_column : 28
    <10e7>   DW_AT_type        : <0x2b1>
    <10eb>   DW_AT_data_member_location: 88
 <2><10ec>: Abbrev Number: 16 (DW_TAG_member)
    <10ed>   DW_AT_name        : (indirect string, offset: 0x14f50): RxXferCount
    <10f1>   DW_AT_decl_file   : 16
    <10f2>   DW_AT_decl_line   : 229
    <10f3>   DW_AT_decl_column : 28
    <10f4>   DW_AT_type        : <0x2bd>
    <10f8>   DW_AT_data_member_location: 90
 <2><10f9>: Abbrev Number: 16 (DW_TAG_member)
    <10fa>   DW_AT_name        : (indirect string, offset: 0xcf0dc): Mask
    <10fe>   DW_AT_decl_file   : 16
    <10ff>   DW_AT_decl_line   : 231
    <1100>   DW_AT_decl_column : 28
    <1101>   DW_AT_type        : <0x2b1>
    <1105>   DW_AT_data_member_location: 92
 <2><1106>: Abbrev Number: 16 (DW_TAG_member)
    <1107>   DW_AT_name        : (indirect string, offset: 0xa9dde): ReceptionType
    <110b>   DW_AT_decl_file   : 16
    <110c>   DW_AT_decl_line   : 233
    <110d>   DW_AT_decl_column : 31
    <110e>   DW_AT_type        : <0x1061>
    <1112>   DW_AT_data_member_location: 96
 <2><1113>: Abbrev Number: 16 (DW_TAG_member)
    <1114>   DW_AT_name        : (indirect string, offset: 0xe322): RxEventType
    <1118>   DW_AT_decl_file   : 16
    <1119>   DW_AT_decl_line   : 235
    <111a>   DW_AT_decl_column : 36
    <111b>   DW_AT_type        : <0x1072>
    <111f>   DW_AT_data_member_location: 100
 <2><1120>: Abbrev Number: 16 (DW_TAG_member)
    <1121>   DW_AT_name        : (indirect string, offset: 0xaf5bc): RxISR
    <1125>   DW_AT_decl_file   : 16
    <1126>   DW_AT_decl_line   : 237
    <1127>   DW_AT_decl_column : 10
    <1128>   DW_AT_type        : <0x11a6>
    <112c>   DW_AT_data_member_location: 104
 <2><112d>: Abbrev Number: 16 (DW_TAG_member)
    <112e>   DW_AT_name        : (indirect string, offset: 0x658ef): TxISR
    <1132>   DW_AT_decl_file   : 16
    <1133>   DW_AT_decl_line   : 239
    <1134>   DW_AT_decl_column : 10
    <1135>   DW_AT_type        : <0x11a6>
    <1139>   DW_AT_data_member_location: 108
 <2><113a>: Abbrev Number: 16 (DW_TAG_member)
    <113b>   DW_AT_name        : (indirect string, offset: 0xc5686): hdmatx
    <113f>   DW_AT_decl_file   : 16
    <1140>   DW_AT_decl_line   : 241
    <1141>   DW_AT_decl_column : 29
    <1142>   DW_AT_type        : <0xf16>
    <1146>   DW_AT_data_member_location: 112
 <2><1147>: Abbrev Number: 16 (DW_TAG_member)
    <1148>   DW_AT_name        : (indirect string, offset: 0xc4af7): hdmarx
    <114c>   DW_AT_decl_file   : 16
    <114d>   DW_AT_decl_line   : 243
    <114e>   DW_AT_decl_column : 29
    <114f>   DW_AT_type        : <0xf16>
    <1153>   DW_AT_data_member_location: 116
 <2><1154>: Abbrev Number: 16 (DW_TAG_member)
    <1155>   DW_AT_name        : (indirect string, offset: 0x753ca): Lock
    <1159>   DW_AT_decl_file   : 16
    <115a>   DW_AT_decl_line   : 245
    <115b>   DW_AT_decl_column : 29
    <115c>   DW_AT_type        : <0x88c>
    <1160>   DW_AT_data_member_location: 120
 <2><1161>: Abbrev Number: 16 (DW_TAG_member)
    <1162>   DW_AT_name        : (indirect string, offset: 0x528f6): gState
    <1166>   DW_AT_decl_file   : 16
    <1167>   DW_AT_decl_line   : 247
    <1168>   DW_AT_decl_column : 33
    <1169>   DW_AT_type        : <0x1050>
    <116d>   DW_AT_data_member_location: 124
 <2><116e>: Abbrev Number: 16 (DW_TAG_member)
    <116f>   DW_AT_name        : (indirect string, offset: 0xb6fd9): RxState
    <1173>   DW_AT_decl_file   : 16
    <1174>   DW_AT_decl_line   : 251
    <1175>   DW_AT_decl_column : 33
    <1176>   DW_AT_type        : <0x1050>
    <117a>   DW_AT_data_member_location: 128
 <2><117b>: Abbrev Number: 16 (DW_TAG_member)
    <117c>   DW_AT_name        : (indirect string, offset: 0xc62b1): ErrorCode
    <1180>   DW_AT_decl_file   : 16
    <1181>   DW_AT_decl_line   : 254
    <1182>   DW_AT_decl_column : 33
    <1183>   DW_AT_type        : <0x2df>
    <1187>   DW_AT_data_member_location: 132
 <2><1188>: Abbrev Number: 0
 <1><1189>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <118a>   DW_AT_byte_size   : 4
    <118b>   DW_AT_type        : <0x80f>
 <1><118f>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <1190>   DW_AT_byte_size   : 4
    <1191>   DW_AT_type        : <0x2ac>
 <1><1195>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <1196>   DW_AT_prototyped  : 1
    <1196>   DW_AT_sibling     : <0x11a0>
 <2><119a>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <119b>   DW_AT_type        : <0x11a0>
 <2><119f>: Abbrev Number: 0
 <1><11a0>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <11a1>   DW_AT_byte_size   : 4
    <11a2>   DW_AT_type        : <0x1077>
 <1><11a6>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <11a7>   DW_AT_byte_size   : 4
    <11a8>   DW_AT_type        : <0x1195>
 <1><11ac>: Abbrev Number: 20 (DW_TAG_typedef)
    <11ad>   DW_AT_name        : (indirect string, offset: 0x76430): UART_HandleTypeDef
    <11b1>   DW_AT_decl_file   : 16
    <11b2>   DW_AT_decl_line   : 272
    <11b4>   DW_AT_decl_column : 3
    <11b5>   DW_AT_type        : <0x1077>
 <1><11b9>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <11ba>   DW_AT_encoding    : 7	(unsigned)
    <11bb>   DW_AT_byte_size   : 1
    <11bc>   DW_AT_type        : <0x23d>
    <11c0>   DW_AT_decl_file   : 17
    <11c1>   DW_AT_decl_line   : 61
    <11c2>   DW_AT_decl_column : 1
    <11c3>   DW_AT_sibling     : <0x11e0>
 <2><11c7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <11c8>   DW_AT_name        : (indirect string, offset: 0x6829d): HAL_TICK_FREQ_10HZ
    <11cc>   DW_AT_const_value : 100
 <2><11cd>: Abbrev Number: 4 (DW_TAG_enumerator)
    <11ce>   DW_AT_name        : (indirect string, offset: 0x4bac1): HAL_TICK_FREQ_100HZ
    <11d2>   DW_AT_const_value : 10
 <2><11d3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <11d4>   DW_AT_name        : (indirect string, offset: 0x5ea04): HAL_TICK_FREQ_1KHZ
    <11d8>   DW_AT_const_value : 1
 <2><11d9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <11da>   DW_AT_name        : (indirect string, offset: 0x49b63): HAL_TICK_FREQ_DEFAULT
    <11de>   DW_AT_const_value : 1
 <2><11df>: Abbrev Number: 0
 <1><11e0>: Abbrev Number: 6 (DW_TAG_typedef)
    <11e1>   DW_AT_name        : (indirect string, offset: 0xa0295): HAL_TickFreqTypeDef
    <11e5>   DW_AT_decl_file   : 17
    <11e6>   DW_AT_decl_line   : 66
    <11e7>   DW_AT_decl_column : 3
    <11e8>   DW_AT_type        : <0x11b9>
 <1><11ec>: Abbrev Number: 10 (DW_TAG_variable)
    <11ed>   DW_AT_name        : (indirect string, offset: 0x2ec92): uwTick
    <11f1>   DW_AT_decl_file   : 17
    <11f2>   DW_AT_decl_line   : 890
    <11f4>   DW_AT_decl_column : 22
    <11f5>   DW_AT_type        : <0x2df>
    <11f9>   DW_AT_external    : 1
    <11f9>   DW_AT_declaration : 1
 <1><11f9>: Abbrev Number: 10 (DW_TAG_variable)
    <11fa>   DW_AT_name        : (indirect string, offset: 0x98aae): uwTickPrio
    <11fe>   DW_AT_decl_file   : 17
    <11ff>   DW_AT_decl_line   : 891
    <1201>   DW_AT_decl_column : 17
    <1202>   DW_AT_type        : <0x2d3>
    <1206>   DW_AT_external    : 1
    <1206>   DW_AT_declaration : 1
 <1><1206>: Abbrev Number: 10 (DW_TAG_variable)
    <1207>   DW_AT_name        : (indirect string, offset: 0xb79fe): uwTickFreq
    <120b>   DW_AT_decl_file   : 17
    <120c>   DW_AT_decl_line   : 892
    <120e>   DW_AT_decl_column : 28
    <120f>   DW_AT_type        : <0x11e0>
    <1213>   DW_AT_external    : 1
    <1213>   DW_AT_declaration : 1
 <1><1213>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <1214>   DW_AT_encoding    : 5	(signed)
    <1215>   DW_AT_byte_size   : 4
    <1216>   DW_AT_type        : <0x292>
    <121a>   DW_AT_decl_file   : 18
    <121b>   DW_AT_decl_line   : 82
    <121c>   DW_AT_decl_column : 14
    <121d>   DW_AT_sibling     : <0x1363>
 <2><1221>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1222>   DW_AT_name        : (indirect string, offset: 0x3d041): osPriorityNone
    <1226>   DW_AT_const_value : 0
 <2><1227>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1228>   DW_AT_name        : (indirect string, offset: 0xb0a7b): osPriorityIdle
    <122c>   DW_AT_const_value : 1
 <2><122d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <122e>   DW_AT_name        : (indirect string, offset: 0xbb4e8): osPriorityLow
    <1232>   DW_AT_const_value : 8
 <2><1233>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1234>   DW_AT_name        : (indirect string, offset: 0xa2810): osPriorityLow1
    <1238>   DW_AT_const_value : 9
 <2><1239>: Abbrev Number: 4 (DW_TAG_enumerator)
    <123a>   DW_AT_name        : (indirect string, offset: 0xc06c5): osPriorityLow2
    <123e>   DW_AT_const_value : 10
 <2><123f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1240>   DW_AT_name        : (indirect string, offset: 0xc06d4): osPriorityLow3
    <1244>   DW_AT_const_value : 11
 <2><1245>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1246>   DW_AT_name        : (indirect string, offset: 0xc06e3): osPriorityLow4
    <124a>   DW_AT_const_value : 12
 <2><124b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <124c>   DW_AT_name        : (indirect string, offset: 0xc06f2): osPriorityLow5
    <1250>   DW_AT_const_value : 13
 <2><1251>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1252>   DW_AT_name        : (indirect string, offset: 0xc0701): osPriorityLow6
    <1256>   DW_AT_const_value : 14
 <2><1257>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1258>   DW_AT_name        : (indirect string, offset: 0xc0710): osPriorityLow7
    <125c>   DW_AT_const_value : 15
 <2><125d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <125e>   DW_AT_name        : (indirect string, offset: 0xc2fb8): osPriorityBelowNormal
    <1262>   DW_AT_const_value : 16
 <2><1263>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1264>   DW_AT_name        : (indirect string, offset: 0x79e6b): osPriorityBelowNormal1
    <1268>   DW_AT_const_value : 17
 <2><1269>: Abbrev Number: 4 (DW_TAG_enumerator)
    <126a>   DW_AT_name        : (indirect string, offset: 0xacdcc): osPriorityBelowNormal2
    <126e>   DW_AT_const_value : 18
 <2><126f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1270>   DW_AT_name        : (indirect string, offset: 0x8af81): osPriorityBelowNormal3
    <1274>   DW_AT_const_value : 19
 <2><1275>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1276>   DW_AT_name        : (indirect string, offset: 0xace01): osPriorityBelowNormal4
    <127a>   DW_AT_const_value : 20
 <2><127b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <127c>   DW_AT_name        : (indirect string, offset: 0xace18): osPriorityBelowNormal5
    <1280>   DW_AT_const_value : 21
